// data.js

const data = {
  "variants": [
    {
      "id": 1,
      "name": "Вариант 1",
      "questions": [
        {
          "id": 1,
          "text": "Укажите варианты ответов, в которых верно определена грамматическая основа в одном из предложений или в одной из частей сложного предложения текста. Запишите номера ответов.",
          "body": "(1) Узкая лесная полоса протянулась вдоль реки и скрылась за холмом, а по берегам замерли кусты и молодые ивы.\n(2) В верхней части старого дома были расположены редкие рукописи и старинные карты.\n(3) Сосны, старожилы здешних мест, растут на сухом пригорке.\n(4) Домики, которые будут находиться у самой опушки, уже обозначили на плане, и рабочие начали расчистку.\n(5) Сбор ягод считался у нас делом семейным, когда наступала осень.\n\n1) полоса протянулась (предложение 1)\n2) расположены части (предложение 2)\n3) растут (предложение 3)\n4) которые будут находиться (предложение 4)\n5) сбор являлся (предложение 5)",
          "correctAnswer": "14",
          "answerType": "short"
        },
        {
          "id": 2,
          "text": "Укажите варианты ответов, в которых даны верные характеристики предложений текста. Запишите номера ответов.",
          "body": "(1) Узкая лесная полоса протянулась вдоль реки и скрылась за холмом, а по берегам замерли кусты и молодые ивы.\n(2) В верхней части старого дома были расположены редкие рукописи и старинные карты.\n(3) Сосны, старожилы здешних мест, растут на сухом пригорке.\n(4) Домики, которые будут находиться у самой опушки, уже обозначили на плане, и рабочие начали расчистку.\n(5) Сбор ягод считался у нас делом семейным, когда наступала осень.\n\n1) Вторая часть сложного предложения 1 осложнена однородными членами предложения.\n2) В предложении 2 содержится простое глагольное сказуемое.\n3) Предложение 3 осложнено обособленным согласованным приложением.\n4) Вторая часть сложного предложения 4 представлена односоставным безличным предложением.\n5) Предложение 5 бессоюзное сложное предложение.",
          "correctAnswer": "13",
          "answerType": "short"
        },
        {
          "id": 3,
          "text": "Установите соответствие между пунктуационными правилами и предложениями, которые могут служить примерами для приведённых правил. Запишите цифры в порядке АБВ.",
          "body": "ПУНКТУАЦИОННЫЕ ПРАВИЛА\n\nА) В неполном предложении на месте пропущенного члена предложения ставится тире.\nБ) Между частями сложного бессоюзного предложения ставится двоеточие, если вторая часть поясняет, дополняет первую.\nВ) В сложноподчиненном предложении между главным и придаточным предложением ставится запятая.\n\nПРЕДЛОЖЕНИЯ\n\n1) Зимой звёзды на небе ярко блестят — жди лютой стужи.\n2) Создание интерактивных электронных учебников нового поколения — одно из перспективных направлений в модернизации учебного процесса, которое позволит не только повысить интерес обучающихся к предмету, но и улучшить качество обучения.\n3) Виктор Петрович удивился: почему его никто не ищет?\n4) Всюду: на листьях деревьев, на траве, на крышах домов и сараев, покрытых камышом, — до полудня лежала обильная роса, и мы не стали торопиться с выходом в поле.\n5) По одну сторону дороги стройными рядами тянулись тонкие хрупкие берёзки, а по другую — могучие и солидные дубы-великаны.",
          "correctAnswer": "532",
          "answerType": "short"
        },
        {
          "id": 4,
          "text": "Расставьте знаки препинания. Укажите цифры, на месте которых должно стоять тире.",
          "body": "В нашей стране первая консерватория открылась (1) в 1862 году в Петербурге. Её основатель (2) Антон Григорьевич Рубинштейн. Прекрасный композитор и выдающийся пианист (3) неутомимый пропагандист музыкальной культуры и музыкальных знаний (4) так характеризовали его современники. Обязательное условие для поступления в консерваторию (5) определённый уровень профессиональной подготовки. Взрослые ученики часто совмещали музыкальные занятия с обучением в университете или со службой. Для младших существовали научные классы (6) в которых ученики получали (7) примерно такое же общее образование (8) какое давала гимназия.",
          "correctAnswer": "245",
          "answerType": "short"
        },
        {
          "id": 5,
          "text": "Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера ответов.",
          "body": "1) РОСКОШНЫЙ — в корне слова с чередующейся гласной перед -С- пишется буква О.\n2) ПРИМОРСКИЙ — написание приставки определяется её значением — расположение вблизи.\n3) ЧИСТОСЕРДЕЧНЫЙ — сложное имя прилагательное, образованное на основе подчинительного словосочетания, пишется слитно.\n4) БЛЕДНОЛИЦЫЙ (мальчик) — в суффиксе имени прилагательного после Ц пишется буква Ы.\n5) (отнюдь) НЕ РЕШИТЕЛЬНЫЙ (поступок) — раздельное написание частицы НЕ с именем прилагательным определяется словом, усиливающим отрицание.",
          "correctAnswer": "235",
          "answerType": "short"
        },
        {
          "id": 6,
          "text": "Прочитайте текст. Вставьте пропущенные буквы. Укажите все цифры, на месте которых пишется буква О.",
          "body": "Солнечный свет охват(1)..вал и с(2)..гревал океаны сентябрьского воздуха над ещ(3).. спящей и сумр(4)..чной стр(5)..ной. Но через полчаса земля начала (6)..деваться в б(7)..грянец, в ржавчину сжатых п(8)..лей, в сырую и яркую зелень озимых, в пурпур осин(9)..вых листьев и желтизну трепещущих от ветра берёз.",
          "correctAnswer": "2689",
          "answerType": "short"
        },
        {
          "id": 7,
          "text": "Раскройте скобки и запишите слово в соответствующей форме, соблюдая нормы современного русского литературного языка.",
          "body": "Самому древнему маяку из действующих до наших дней более (шестьсот) лет.",
          "correctAnswer": "шестисот",
          "answerType": "short"
        },
        {
          "id": 8,
          "text": "Синтаксический анализ. Замените словосочетание, построенное на основе управления, синонимичным словосочетанием со связью примыкание. Напишите получившееся словосочетание, соблюдая нормы современного русского литературного языка.",
          "body": "Замените словосочетание «отвечал с запинками», построенное на основе управления, синонимичным словосочетанием со связью примыкание.",
          "correctAnswer": "отвечал запинаясь",
          "answerType": "short"
        },
        {
          "id": 9,
          "text": "Анализ содержания текста. Какие из высказываний соответствуют содержанию текста? Укажите номера ответов.",
          "body": "(1) В нашей паре я был ведущим, а Павлик ведомым. (2) Недоброжелатели считали, что Павлик был приложением ко мне. (3) На первый взгляд так оно и было. (4) Меня нельзя было приглашать на день рождения без Павлика. (5) Я покинул футбольную дворовую команду, где считался лучшим бомбардиром, когда Павлика отказались взять хотя бы запасным, и вернулся вместе с ним. (6) Так возникла иллюзия нашего неравенства. (7) На самом деле ни один из нас не зависел от другого, но душевное превосходство было на стороне Павлика. (8) Его нравственный кодекс был строже и чище моего. (9) Павлик не признавал сделок с совестью, тут он становился беспощаден.\n\n(10) Однажды я на своей шкуре испытал, насколько непримиримым может быть мягкий, покладистый Павлик. (11) На уроках немецкого я чувствовал себя принцем. (12) Я с детства хорошо знал язык, и наша «немка» Елена Францевна души во мне не чаяла и никогда не спрашивала у меня уроков. (13) Вдруг ни с того ни с сего она вызвала меня к доске. (14) Как раз перед этим я пропустил несколько дней и не знал о домашнем задании. (15) Поначалу всё шло хорошо: я проспрягал какой-то глагол, отбарабанил предлоги, прочёл текст и пересказал его.\n\n— (16) Прекрасно, — поджала губы Елена Францевна. — (17) Теперь стихотворение.\n\n— (18) Какое стихотворение?\n\n— (19) То, которое задано! — отчеканила она ледяным тоном.\n\n— (20) А вы разве задавали?\n\n— (21) Привык на уроках ворон считать! — завелась она с пол-оборота. — (22) Здоровенный парень, а дисциплина...\n\n— (23) Да я же болел!\n\n— (24) Да, ты отсутствовал. (25) А спросить у товарищей, что задано, мозгов не хватило?\n\n(26) Взял бы да и сказал: не хватило. (27) Ну что она могла мне сделать? (28) О домашних заданиях я спрашивал у Павлика, а он ни словом не обмолвился о стихотворении. (29) Забыл, наверное. (30) Я так и сказал Елене Францевне.\n\n— (31) Встань! — приказала Павлику немка. — (32) Это правда?\n\n(33) Он молча наклонил голову. (34) И я тут же понял, что это неправда. (35) Как раз о немецком я его не спрашивал...\n\n(36) Елена Францевна перенесла свой гнев на Павлика. (37) Он слушал её молча, не оправдываясь и не огрызаясь, словно всё это нисколько его не касалось. (38) Спустив пары, немка угомонилась и предложила мне прочесть любое стихотворение на выбор... (39) Я получил «отлично».\n\n(40) Вот так всё и обошлось. (41) Когда, довольный и счастливый, я вернулся на своё место, Павлика, к моему удивлению, не оказалось рядом. (42) Он сидел за пустой партой далеко от меня.\n\n— (43) Ты чего это?..\n\n(44) Он не ответил. (45) У него были какие-то странные глаза — красные и налитые влагой. (46) Я никогда не видел Павлика плачущим. (47) Даже после самых жестоких, неравных и неудачных драк, когда и самые сильные ребята плачут, он не плакал.\n\n— (48) Брось! — сказал я. — (49) Стоит ли из-за учительницы?\n\n(50) Он молчал и глядел мимо меня. (51) Какое ему дело до Елены Францевны, он и думать о ней забыл. (52) Его предал друг. (53) Спокойно, обыденно и публично, ради грошовой выгоды предал человек, за которого он, не раздумывая, пошёл бы в огонь и в воду.\n\n(54) Никому не хочется признаваться в собственной низости. (55) Я стал уговаривать себя, что поступил правильно. (56) Ну покричала на него немка, подумаешь, несчастье! (57) Стоит ли вообще придавать значение подобной чепухе?.. (58) И всё же, окажись Павлик на моем месте, назвал бы он меня? (59) Нет! (60) Он скорее проглотил бы собственный язык. (61) Когда прозвучал звонок, я подавил желание броситься к нему, признавая тем самым свою вину и готовность принять кару.\n\n(62) Потом было немало случаев, когда мы могли бы вернуться к прежней дружбе, но Павлик не хотел этого: ему не нужен был тот человек, каким я вдруг раскрылся на уроке немецкого.\n\n1) Павлик не мог смириться с ролью ведомого в дружбе.\n2) Рассказчик хорошо знал немецкий язык, поэтому учительница любила его и редко спрашивала домашнее задание.\n3) Елена Францевна поставила рассказчику двойку за невыученное стихотворение.\n4) Рассказчик никогда не узнавал домашнего задания у Павлика.\n5) Павлик не простил другу предательства.",
          "correctAnswer": "25",
          "answerType": "short"
        },
        {
          "id": 10,
          "text": "Анализ средств выразительности. Укажите варианты ответов, в которых средством выразительности речи является фразеологизм.",
          "body": "(1) В нашей паре я был ведущим, а Павлик ведомым. (2) Недоброжелатели считали, что Павлик был приложением ко мне. (3) На первый взгляд так оно и было. (4) Меня нельзя было приглашать на день рождения без Павлика. (5) Я покинул футбольную дворовую команду, где считался лучшим бомбардиром, когда Павлика отказались взять хотя бы запасным, и вернулся вместе с ним. (6) Так возникла иллюзия нашего неравенства. (7) На самом деле ни один из нас не зависел от другого, но душевное превосходство было на стороне Павлика. (8) Его нравственный кодекс был строже и чище моего. (9) Павлик не признавал сделок с совестью, тут он становился беспощаден.\n\n(10) Однажды я на своей шкуре испытал, насколько непримиримым может быть мягкий, покладистый Павлик. (11) На уроках немецкого я чувствовал себя принцем. (12) Я с детства хорошо знал язык, и наша «немка» Елена Францевна души во мне не чаяла и никогда не спрашивала у меня уроков. (13) Вдруг ни с того ни с сего она вызвала меня к доске. (14) Как раз перед этим я пропустил несколько дней и не знал о домашнем задании. (15) Поначалу всё шло хорошо: я проспрягал какой-то глагол, отбарабанил предлоги, прочёл текст и пересказал его.\n\n— (16) Прекрасно, — поджала губы Елена Францевна. — (17) Теперь стихотворение.\n\n— (18) Какое стихотворение?\n\n— (19) То, которое задано! — отчеканила она ледяным тоном.\n\n— (20) А вы разве задавали?\n\n— (21) Привык на уроках ворон считать! — завелась она с пол-оборота. — (22) Здоровенный парень, а дисциплина...\n\n— (23) Да я же болел!\n\n— (24) Да, ты отсутствовал. (25) А спросить у товарищей, что задано, мозгов не хватило?\n\n(26) Взял бы да и сказал: не хватило. (27) Ну что она могла мне сделать? (28) О домашних заданиях я спрашивал у Павлика, а он ни словом не обмолвился о стихотворении. (29) Забыл, наверное. (30) Я так и сказал Елене Францевне.\n\n— (31) Встань! — приказала Павлику немка. — (32) Это правда?\n\n(33) Он молча наклонил голову. (34) И я тут же понял, что это неправда. (35) Как раз о немецком я его не спрашивал...\n\n(36) Елена Францевна перенесла свой гнев на Павлика. (37) Он слушал её молча, не оправдываясь и не огрызаясь, словно всё это нисколько его не касалось. (38) Спустив пары, немка угомонилась и предложила мне прочесть любое стихотворение на выбор... (39) Я получил «отлично».\n\n(40) Вот так всё и обошлось. (41) Когда, довольный и счастливый, я вернулся на своё место, Павлика, к моему удивлению, не оказалось рядом. (42) Он сидел за пустой партой далеко от меня.\n\n— (43) Ты чего это?..\n\n(44) Он не ответил. (45) У него были какие-то странные глаза — красные и налитые влагой. (46) Я никогда не видел Павлика плачущим. (47) Даже после самых жестоких, неравных и неудачных драк, когда и самые сильные ребята плачут, он не плакал.\n\n— (48) Брось! — сказал я. — (49) Стоит ли из-за учительницы?\n\n(50) Он молчал и глядел мимо меня. (51) Какое ему дело до Елены Францевны, он и думать о ней забыл. (52) Его предал друг. (53) Спокойно, обыденно и публично, ради грошовой выгоды предал человек, за которого он, не раздумывая, пошёл бы в огонь и в воду.\n\n(54) Никому не хочется признаваться в собственной низости. (55) Я стал уговаривать себя, что поступил правильно. (56) Ну покричала на него немка, подумаешь, несчастье! (57) Стоит ли вообще придавать значение подобной чепухе?.. (58) И всё же, окажись Павлик на моем месте, назвал бы он меня? (59) Нет! (60) Он скорее проглотил бы собственный язык. (61) Когда прозвучал звонок, я подавил желание броситься к нему, признавая тем самым свою вину и готовность принять кару.\n\n(62) Потом было немало случаев, когда мы могли бы вернуться к прежней дружбе, но Павлик не хотел этого: ему не нужен был тот человек, каким я вдруг раскрылся на уроке немецкого.\n\n1) На уроках немецкого я чувствовал себя принцем.\n2) Даже после самых жестоких, неравных и неудачных драк, когда и самые сильные ребята плачут, он не плакал.\n3) Недоброжелатели считали, что Павлик был приложением ко мне.\n4) Я с детства хорошо знал язык, и наша «немка» Елена Францевна души во мне не чаяла и никогда не спрашивала у меня уроков.\n5) Вдруг ни с того ни с сего она вызвала меня к доске.",
          "correctAnswer": "45",
          "answerType": "short"
        },
        {
          "id": 11,
          "text": "Лексический анализ. Выпишите синоним из указанного диапазона предложений.",
          "body": "(1) В нашей паре я был ведущим, а Павлик ведомым. (2) Недоброжелатели считали, что Павлик был приложением ко мне. (3) На первый взгляд так оно и было. (4) Меня нельзя было приглашать на день рождения без Павлика. (5) Я покинул футбольную дворовую команду, где считался лучшим бомбардиром, когда Павлика отказались взять хотя бы запасным, и вернулся вместе с ним. (6) Так возникла иллюзия нашего неравенства. (7) На самом деле ни один из нас не зависел от другого, но душевное превосходство было на стороне Павлика. (8) Его нравственный кодекс был строже и чище моего. (9) Павлик не признавал сделок с совестью, тут он становился беспощаден.\n\n(10) Однажды я на своей шкуре испытал, насколько непримиримым может быть мягкий, покладистый Павлик. (11) На уроках немецкого я чувствовал себя принцем. (12) Я с детства хорошо знал язык, и наша «немка» Елена Францевна души во мне не чаяла и никогда не спрашивала у меня уроков. (13) Вдруг ни с того ни с сего она вызвала меня к доске. (14) Как раз перед этим я пропустил несколько дней и не знал о домашнем задании. (15) Поначалу всё шло хорошо: я проспрягал какой-то глагол, отбарабанил предлоги, прочёл текст и пересказал его.\n\n— (16) Прекрасно, — поджала губы Елена Францевна. — (17) Теперь стихотворение.\n\n— (18) Какое стихотворение?\n\n— (19) То, которое задано! — отчеканила она ледяным тоном.\n\n— (20) А вы разве задавали?\n\n— (21) Привык на уроках ворон считать! — завелась она с пол-оборота. — (22) Здоровенный парень, а дисциплина...\n\n— (23) Да я же болел!\n\n— (24) Да, ты отсутствовал. (25) А спросить у товарищей, что задано, мозгов не хватило?\n\n(26) Взял бы да и сказал: не хватило. (27) Ну что она могла мне сделать? (28) О домашних заданиях я спрашивал у Павлика, а он ни словом не обмолвился о стихотворении. (29) Забыл, наверное. (30) Я так и сказал Елене Францевне.\n\n— (31) Встань! — приказала Павлику немка. — (32) Это правда?\n\n(33) Он молча наклонил голову. (34) И я тут же понял, что это неправда. (35) Как раз о немецком я его не спрашивал...\n\n(36) Елена Францевна перенесла свой гнев на Павлика. (37) Он слушал её молча, не оправдываясь и не огрызаясь, словно всё это нисколько его не касалось. (38) Спустив пары, немка угомонилась и предложила мне прочесть любое стихотворение на выбор... (39) Я получил «отлично».\n\n(40) Вот так всё и обошлось. (41) Когда, довольный и счастливый, я вернулся на своё место, Павлика, к моему удивлению, не оказалось рядом. (42) Он сидел за пустой партой далеко от меня.\n\n— (43) Ты чего это?..\n\n(44) Он не ответил. (45) У него были какие-то странные глаза — красные и налитые влагой. (46) Я никогда не видел Павлика плачущим. (47) Даже после самых жестоких, неравных и неудачных драк, когда и самые сильные ребята плачут, он не плакал.\n\n— (48) Брось! — сказал я. — (49) Стоит ли из-за учительницы?\n\n(50) Он молчал и глядел мимо меня. (51) Какое ему дело до Елены Францевны, он и думать о ней забыл. (52) Его предал друг. (53) Спокойно, обыденно и публично, ради грошовой выгоды предал человек, за которого он, не раздумывая, пошёл бы в огонь и в воду.\n\n(54) Никому не хочется признаваться в собственной низости. (55) Я стал уговаривать себя, что поступил правильно. (56) Ну покричала на него немка, подумаешь, несчастье! (57) Стоит ли вообще придавать значение подобной чепухе?.. (58) И всё же, окажись Павлик на моем месте, назвал бы он меня? (59) Нет! (60) Он скорее проглотил бы собственный язык. (61) Когда прозвучал звонок, я подавил желание броситься к нему, признавая тем самым свою вину и готовность принять кару.\n\n(62) Потом было немало случаев, когда мы могли бы вернуться к прежней дружбе, но Павлик не хотел этого: ему не нужен был тот человек, каким я вдруг раскрылся на уроке немецкого.\n\nСреди предложений 21–25 найдите синоним к слову ДРУГ из предложения 52. Выпишите этот синоним.",
          "correctAnswer": "товарищей",
          "answerType": "short"
        },
        {
          "id": 12,
          "text": "Используя прочитанный текст, выполните на отдельном листе ТОЛЬКО ОДНО из заданий (1, 2 или 3). Перед написанием сочинения запишите номер выбранного задания (1, 2 или 3).",
          "body": "1. Напишите сочинение-рассуждение на тему: «Какие средства языка использовал автор, чтобы создать образы мальчишек?».\n\nПриведите в сочинении два примера из прочитанного текста, подтверждающих Ваши рассуждения. Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой полностью переписанный или пересказанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком.\n\n2. Напишите сочинение-рассуждение. Объясните, как Вы понимаете смысл смысл финала текста: «Но он рад был происшествию, потому что Витёк его зауважал и Сивка оказался Сивкой, а не чем-то вроде...».\n\nПриведите в сочинении два примера из прочитанного текста, подтверждающих Ваши рассуждения. Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой полностью переписанный или пересказанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком.\n\n3. Напишите сочинение-рассуждение на тему «Как можно завоевать уважение?». Дайте обоснованный ответ на вопрос, сформулированный в теме сочинения.\n\nПриведите в сочинении два примера, подтверждающих Ваши рассуждения: один пример — из прочитанного текста, а другой — из прочитанного текста или из Вашего жизненного опыта. (Не учитываются примеры, источниками которых являются комикс, аниме, манга, фанфик, графический роман, компьютерная игра и другие подобные виды представления информации.) Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой пересказанный или полностью переписанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком.",
          "correctAnswer": "",
          "answerType": "long"
        }
      ]
    },
    {
      "id": 2,
      "name": "Вариант 2",
      "questions": [
        {
          "id": 1,
          "text": "Укажите варианты ответов, в которых верно определена грамматическая основа в одном из предложений или в одной из частей сложного предложения текста. Запишите номера ответов.",
          "body": "(1) Вечером на площади зажглись фонари, и влажный воздух сразу стал теплее.\n(2) По краям аллеи были высажены молодые липы.\n(3) Ребята, участники школьного театра, готовились к премьере.\n(4) Люди, которые пришли пораньше, уже заняли первые ряды.\n(5) Праздник обещал запомниться надолго.\n\n1) фонари зажглись (предложение 1)\n2) были высажены липы (предложение 2)\n3) участники готовились (предложение 3)\n4) которые пришли (предложение 4)\n5) праздник обещал (предложение 5)",
          "correctAnswer": "145",
          "answerType": "short"
        },
        {
          "id": 2,
          "text": "Укажите варианты ответов, в которых даны верные характеристики предложений текста. Запишите номера ответов.",
          "body": "(1) Вечером на площади зажглись фонари, и влажный воздух сразу стал теплее.\n(2) По краям аллеи были высажены молодые липы.\n(3) Ребята, участники школьного театра, готовились к премьере.\n(4) Люди, которые пришли пораньше, уже заняли первые ряды.\n(5) Праздник обещал запомниться надолго.\n\n1) Предложение 1 сложносочинённое.\n2) В предложении 2 сказуемое составное именное.\n3) Предложение 3 осложнено приложением.\n4) В предложении 4 есть придаточное определительное.\n5) Предложение 5 односоставное безличное.",
          "correctAnswer": "134",
          "answerType": "short"
        },
        {
          "id": 3,
          "text": "Установите соответствие между пунктуационными правилами и предложениями, которые могут служить примерами для приведённых правил. Запишите цифры в порядке АБВ.",
          "body": "ПУНКТУАЦИОННЫЕ ПРАВИЛА\n\nА) Между подлежащим и сказуемым ставится тире, если оба главных члена выражены существительными в именительном падеже.\nБ) Между частями сложного бессоюзного предложения ставится двоеточие, если вторая часть указывает на причину того, о чём говорится в первой.\nВ) В сложноподчинённом предложении между главным и придаточным предложением ставится запятая.\n\nПРЕДЛОЖЕНИЯ\n\n1) Учение — путь к мастерству.\n2) Я остановился: впереди послышались шаги.\n3) Когда ветер стих, лодка мягко коснулась берега.\n4) Летом луга покрываются цветами, и воздух становится особенно душистым.\n5) Утром в саду щебетали птицы.",
          "correctAnswer": "123",
          "answerType": "short"
        },
        {
          "id": 4,
          "text": "Расставьте знаки препинания. Укажите цифры, на месте которых должно стоять тире.",
          "body": "Наш лучший учитель (1) Иван Петрович. Его главное качество (2) терпение. Чтение хороших книг (3) верный путь к развитию. Вечером мы вышли на крыльцо (4) и долго смотрели на сад. Осенняя тишина (5) настоящее чудо.",
          "correctAnswer": "1235",
          "answerType": "short"
        },
        {
          "id": 5,
          "text": "Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера ответов.",
          "body": "1) ПРИШКОЛЬНЫЙ — приставка ПРИ- имеет значение близости.\n2) БЕСШУМНЫЙ — на конце приставки перед глухим согласным пишется С.\n3) ЦЫПЛЁНОК — после Ц в корне всегда пишется И.\n4) НЕ СДЕЛАННАЯ МНОЙ работа — причастие с зависимым словом пишется раздельно.\n5) КОСНУТЬСЯ — в корне с чередованием пишется О, если после корня нет суффикса -А-.",
          "correctAnswer": "145",
          "answerType": "short"
        },
        {
          "id": 6,
          "text": "Прочитайте текст. Вставьте пропущенные буквы. Укажите все цифры, на месте которых пишется буква О.",
          "body": "Ранним утром мы выск(1)..чили из дома, быстро прик(2)..снулись к холодной воде родника и пошли по тр(3)..пинке к старому м(4)..сту. Солнце заг(5)..ралось над лесом всё ярче.",
          "correctAnswer": "12345",
          "answerType": "short"
        },
        {
          "id": 7,
          "text": "Раскройте скобки и запишите слово в соответствующей форме, соблюдая нормы современного русского литературного языка.",
          "body": "В коллекции музея более (семьсот) экспонатов.",
          "correctAnswer": "семисот",
          "answerType": "short"
        },
        {
          "id": 8,
          "text": "Синтаксический анализ. Замените словосочетание, построенное на основе управления, синонимичным словосочетанием со связью примыкание. Напишите получившееся словосочетание, соблюдая нормы современного русского литературного языка.",
          "body": "Замените словосочетание «говорил без умолку» синонимичным словосочетанием со связью примыкание.",
          "correctAnswer": "говорил не умолкая",
          "answerType": "short"
        },
        {
          "id": 9,
          "text": "Анализ содержания текста. Какие из высказываний соответствуют содержанию текста? Укажите номера ответов.",
          "body": "(1) В школьной библиотеке работала Анна Сергеевна. (2) Она знала по имени почти каждого ученика и всегда помнила, какую книгу тот взял в прошлый раз. (3) Я заходил туда не столько за учебниками, сколько за разговорами. (4) Стоило мне появиться на пороге, как библиотекарь сразу понимала, в каком я настроении. (5) Если я молчал, она не тянула меня за язык и просто ставила на стол новую книгу. (6) Однажды я пришёл мрачнее тучи: на районной олимпиаде занял только второе место. (7) Мне казалось, что я сел в лужу перед всей школой. (8) Анна Сергеевна выслушала меня и сказала, что проигрыш — не повод бросать дело. (9) Потом она принесла старый сборник писем учёных и открыла страницу, где известный математик писал о своих провалах. (10) Я читал и понемногу успокаивался. (11) Оказалось, что даже сильные люди не идут к цели по прямой дороге. (12) Перед уходом библиотекарь улыбнулась и попросила вернуть книгу не раньше, чем я дочитаю её до конца. (13) С тех пор я перестал воспринимать каждую неудачу как конец света.\n\n1) Рассказчик ходил в библиотеку только за учебниками.\n2) Анна Сергеевна умела понять настроение рассказчика.\n3) Рассказчик победил на районной олимпиаде.\n4) Библиотекарь посоветовала ему бросить занятия.\n5) После разговора с библиотекарем герой иначе стал смотреть на неудачи.",
          "correctAnswer": "25",
          "answerType": "short"
        },
        {
          "id": 10,
          "text": "Анализ средств выразительности. Укажите варианты ответов, в которых средством выразительности речи является фразеологизм.",
          "body": "(1) В школьной библиотеке работала Анна Сергеевна. (2) Она знала по имени почти каждого ученика и всегда помнила, какую книгу тот взял в прошлый раз. (3) Я заходил туда не столько за учебниками, сколько за разговорами. (4) Стоило мне появиться на пороге, как библиотекарь сразу понимала, в каком я настроении. (5) Если я молчал, она не тянула меня за язык и просто ставила на стол новую книгу. (6) Однажды я пришёл мрачнее тучи: на районной олимпиаде занял только второе место. (7) Мне казалось, что я сел в лужу перед всей школой. (8) Анна Сергеевна выслушала меня и сказала, что проигрыш — не повод бросать дело. (9) Потом она принесла старый сборник писем учёных и открыла страницу, где известный математик писал о своих провалах. (10) Я читал и понемногу успокаивался. (11) Оказалось, что даже сильные люди не идут к цели по прямой дороге. (12) Перед уходом библиотекарь улыбнулась и попросила вернуть книгу не раньше, чем я дочитаю её до конца. (13) С тех пор я перестал воспринимать каждую неудачу как конец света.\n\n1) Я заходил туда не столько за учебниками, сколько за разговорами.\n2) Если я молчал, она не тянула меня за язык.\n3) Потом она принесла старый сборник писем учёных.\n4) Мне казалось, что я сел в лужу перед всей школой.\n5) Я читал и понемногу успокаивался.",
          "correctAnswer": "24",
          "answerType": "short"
        },
        {
          "id": 11,
          "text": "Лексический анализ. Выпишите синоним из указанного диапазона предложений.",
          "body": "(1) В школьной библиотеке работала Анна Сергеевна. (2) Она знала по имени почти каждого ученика и всегда помнила, какую книгу тот взял в прошлый раз. (3) Я заходил туда не столько за учебниками, сколько за разговорами. (4) Стоило мне появиться на пороге, как библиотекарь сразу понимала, в каком я настроении. (5) Если я молчал, она не тянула меня за язык и просто ставила на стол новую книгу. (6) Однажды я пришёл мрачнее тучи: на районной олимпиаде занял только второе место. (7) Мне казалось, что я сел в лужу перед всей школой. (8) Анна Сергеевна выслушала меня и сказала, что проигрыш — не повод бросать дело. (9) Потом она принесла старый сборник писем учёных и открыла страницу, где известный математик писал о своих провалах. (10) Я читал и понемногу успокаивался. (11) Оказалось, что даже сильные люди не идут к цели по прямой дороге. (12) Перед уходом библиотекарь улыбнулась и попросила вернуть книгу не раньше, чем я дочитаю её до конца. (13) С тех пор я перестал воспринимать каждую неудачу как конец света.\n\nСреди предложений 8–13 найдите синоним к слову ПРОИГРЫШ из предложения 8. Выпишите этот синоним.",
          "correctAnswer": "неудачу",
          "answerType": "short"
        },
        {
          "id": 12,
          "text": "Используя прочитанный текст, выполните на отдельном листе ТОЛЬКО ОДНО из заданий (13.1, 13.2 или 13.3).",
          "body": "13.1 Напишите сочинение-рассуждение на тему «Какую роль в тексте играют олицетворения?».\n\nДайте ответ на вопрос, сформулированный в теме сочинения.\n\nПриведите в сочинении два примера из прочитанного текста, подтверждающих Ваши рассуждения. Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nСделайте вывод на основе Ваших рассуждений.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой полностью переписанный или пересказанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком, соблюдая нормы современного русского литературного языка.\n\n13.2 Напишите сочинение-рассуждение. Объясните, как Вы понимаете финал данного текста: «Он бежал обратно к музыкальному училищу, к скрипке, к самому себе».\n\nДайте ответ на вопрос, сформулированный в теме сочинения.\n\nПриведите в сочинении два примера из прочитанного текста, подтверждающих Ваши рассуждения. Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nСделайте вывод на основе Ваших рассуждений.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой полностью переписанный или пересказанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком, соблюдая нормы современного русского литературного языка.\n\n13.3 Напишите сочинение-рассуждение на тему «Почему важно оставаться верным своим убеждениям?».\n\nДайте ответ на вопрос, сформулированный в теме сочинения.\n\nПриведите в сочинении два примера из прочитанного текста, подтверждающих Ваши рассуждения. Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nСделайте вывод на основе Ваших рассуждений.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой полностью переписанный или пересказанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком, соблюдая нормы современного русского литературного языка.",
          "correctAnswer": "",
          "answerType": "long"
        }
      ]
    },
    {
      "id": 3,
      "name": "Вариант 3",
      "questions": [
        {
          "id": 1,
          "text": "Укажите варианты ответов, в которых верно определена грамматическая основа в одном из предложений или в одной из частей сложного предложения текста. Запишите номера ответов.",
          "body": "(1) Утром море блестело и казалось неподвижным.\n(2) На горизонте были видны рыбацкие лодки.\n(3) Чайки, вечные спутницы берега, кружили над водой.\n(4) Люди, которые приехали на рассвете, уже расставляли снасти.\n(5) День обещал быть тёплым.\n\n1) море блестело (предложение 1)\n2) на горизонте были видны (предложение 2)\n3) спутницы кружили (предложение 3)\n4) которые приехали (предложение 4)\n5) день обещал (предложение 5)",
          "correctAnswer": "145",
          "answerType": "short"
        },
        {
          "id": 2,
          "text": "Укажите варианты ответов, в которых даны верные характеристики предложений текста. Запишите номера ответов.",
          "body": "(1) Утром море блестело и казалось неподвижным.\n(2) На горизонте были видны рыбацкие лодки.\n(3) Чайки, вечные спутницы берега, кружили над водой.\n(4) Люди, которые приехали на рассвете, уже расставляли снасти.\n(5) День обещал быть тёплым.\n\n1) Предложение 1 осложнено однородными сказуемыми.\n2) Предложение 2 является односоставным безличным.\n3) Предложение 3 осложнено обособленным приложением.\n4) В предложении 4 есть придаточное определительное.\n5) Предложение 5 является сложносочинённым.",
          "correctAnswer": "134",
          "answerType": "short"
        },
        {
          "id": 3,
          "text": "Установите соответствие между пунктуационными правилами и предложениями, которые могут служить примерами для приведённых правил. Запишите цифры в порядке АБВ.",
          "body": "ПУНКТУАЦИОННЫЕ ПРАВИЛА\n\nА) В неполном предложении на месте пропущенного члена предложения ставится тире.\nБ) Между частями сложного бессоюзного предложения ставится двоеточие, если вторая часть поясняет первую.\nВ) Между частями сложносочинённого предложения ставится запятая.\n\nПРЕДЛОЖЕНИЯ\n\n1) Я остановился: впереди лежало поваленное дерево.\n2) По одну сторону улицы тянулись клёны, а по другую — липы.\n3) Мы долго ждали, но поезд всё не приходил.\n4) Когда рассвело, дорога показалась совсем иной.\n5) На столе лежали тетради: красные, синие, зелёные.",
          "correctAnswer": "213",
          "answerType": "short"
        },
        {
          "id": 4,
          "text": "Расставьте знаки препинания. Укажите цифры, на месте которых должно стоять тире.",
          "body": "Наш главный помощник в походе (1) карта. Её составитель (2) опытный географ. Самое трудное в этом маршруте (3) не подъём, а длинный спуск. Внизу нас ждала река (4) и широкая поляна. Последняя остановка (5) у старой мельницы. Для уставших путников эта поляна (6) настоящий подарок.",
          "correctAnswer": "12356",
          "answerType": "short"
        },
        {
          "id": 5,
          "text": "Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера ответов.",
          "body": "1) ПРИБЕЖАТЬ — приставка ПРИ- пишется в значении «очень».\n2) БЕЗЫМЯННЫЙ — после приставки на согласную вместо И пишется Ы.\n3) ЦИРКУЛЬ — после Ц в корне всегда пишется Ы.\n4) НЕ РЕШЁННЫЙ ВОВРЕМЯ вопрос — причастие с зависимым словом пишется раздельно.\n5) ПРИМОРЬЕ — приставка ПРИ- пишется в значении близости к чему-либо.",
          "correctAnswer": "245",
          "answerType": "short"
        },
        {
          "id": 6,
          "text": "Прочитайте текст. Вставьте пропущенные буквы. Укажите все цифры, на месте которых пишется буква О.",
          "body": "Мы к(1)..снулись ладонями холодной воды, заметили маленький р(2)..сток у берега и вск(3)..ре услышали ш(4)..рох в камышах. Над водой заг(5)..релось солнце, и туман начал рассеиваться.",
          "correctAnswer": "12345",
          "answerType": "short"
        },
        {
          "id": 7,
          "text": "Раскройте скобки и запишите слово в соответствующей форме, соблюдая нормы современного русского литературного языка.",
          "body": "В зале собралось более (восемьсот) зрителей.",
          "correctAnswer": "восьмисот",
          "answerType": "short"
        },
        {
          "id": 8,
          "text": "Синтаксический анализ. Замените словосочетание, построенное на основе управления, синонимичным словосочетанием со связью примыкание. Напишите получившееся словосочетание, соблюдая нормы современного русского литературного языка.",
          "body": "Замените словосочетание «шёл без спешки» синонимичным словосочетанием со связью примыкание.",
          "correctAnswer": "шёл не спеша",
          "answerType": "short"
        },
        {
          "id": 9,
          "text": "Анализ содержания текста. Какие из высказываний соответствуют содержанию текста? Укажите номера ответов.",
          "body": "(1) Каждую весну дед собирал во дворе дощечки и принимался мастерить скворечники. (2) Он вставал ни свет ни заря, чтобы закончить работу до жары. (3) Я сначала смотрел на него из окна и не понимал, зачем тратить время на птиц. (4) Но однажды дед позвал меня в мастерскую и дал маленький молоток. (5) С этого дня дело пошло веселее. (6) Мы вместе выбирали доски, спорили из-за размеров крыши и смеялись, когда гвозди упрямо гнулись. (7) Дед не ругался и никогда не делал всё за меня. (8) Он только повторял, что хороший мастер должен семь раз отмерить. (9) Когда скворечник наконец повис на яблоне, я ходил вокруг него как именинник. (10) Через неделю в домик заселилась первая пара скворцов. (11) Тогда я понял, что мы строили не просто коробку, а жильё для живых существ. (12) С тех пор весеннюю работу я ждал не меньше деда.\n\n1) Дед мастерил скворечники только ради продажи.\n2) Сначала рассказчик не понимал увлечения деда.\n3) Дед постоянно сердился на внука.\n4) Скворечник так и остался лежать в мастерской.\n5) После этой истории герой стал ждать весеннюю работу.",
          "correctAnswer": "25",
          "answerType": "short"
        },
        {
          "id": 10,
          "text": "Анализ средств выразительности. Укажите варианты ответов, в которых средством выразительности речи является фразеологизм.",
          "body": "(1) Каждую весну дед собирал во дворе дощечки и принимался мастерить скворечники. (2) Он вставал ни свет ни заря, чтобы закончить работу до жары. (3) Я сначала смотрел на него из окна и не понимал, зачем тратить время на птиц. (4) Но однажды дед позвал меня в мастерскую и дал маленький молоток. (5) С этого дня дело пошло веселее. (6) Мы вместе выбирали доски, спорили из-за размеров крыши и смеялись, когда гвозди упрямо гнулись. (7) Дед не ругался и никогда не делал всё за меня. (8) Он только повторял, что хороший мастер должен семь раз отмерить. (9) Когда скворечник наконец повис на яблоне, я ходил вокруг него как именинник. (10) Через неделю в домик заселилась первая пара скворцов. (11) Тогда я понял, что мы строили не просто коробку, а жильё для живых существ. (12) С тех пор весеннюю работу я ждал не меньше деда.\n\n1) Он вставал ни свет ни заря, чтобы закончить работу до жары.\n2) Я сначала смотрел на него из окна.\n3) С этого дня дело пошло веселее.\n4) Он только повторял, что хороший мастер должен семь раз отмерить.\n5) Через неделю в домик заселилась первая пара скворцов.",
          "correctAnswer": "14",
          "answerType": "short"
        },
        {
          "id": 11,
          "text": "Лексический анализ. Выпишите синоним из указанного диапазона предложений.",
          "body": "(1) Каждую весну дед собирал во дворе дощечки и принимался мастерить скворечники. (2) Он вставал ни свет ни заря, чтобы закончить работу до жары. (3) Я сначала смотрел на него из окна и не понимал, зачем тратить время на птиц. (4) Но однажды дед позвал меня в мастерскую и дал маленький молоток. (5) С этого дня дело пошло веселее. (6) Мы вместе выбирали доски, спорили из-за размеров крыши и смеялись, когда гвозди упрямо гнулись. (7) Дед не ругался и никогда не делал всё за меня. (8) Он только повторял, что хороший мастер должен семь раз отмерить. (9) Когда скворечник наконец повис на яблоне, я ходил вокруг него как именинник. (10) Через неделю в домик заселилась первая пара скворцов. (11) Тогда я понял, что мы строили не просто коробку, а жильё для живых существ. (12) С тех пор весеннюю работу я ждал не меньше деда.\n\nСреди предложений 1–6 найдите синоним к слову ДОМ из предложения 10. Выпишите этот синоним.",
          "correctAnswer": "скворечники",
          "answerType": "short"
        },
        {
          "id": 12,
          "text": "Используя прочитанный текст, выполните на отдельном листе ТОЛЬКО ОДНО из заданий (1, 2 или 3). Перед написанием сочинения запишите номер выбранного задания (1, 2 или 3).",
          "body": "1. Напишите сочинение-рассуждение на тему «Какие средства языка использовал автор для создания образа Сени Голубкина?».\n\nПриведите в сочинении два примера из прочитанного текста, подтверждающих Ваши рассуждения. Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой полностью переписанный или пересказанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком.\n\n2. Напишите сочинение-рассуждение. Объясните, как Вы понимаете смысл фрагмента текста: «Он не проникся благодарностью к Ване Белову, напротив, именно с тех пор и невзлюбил его. Голубкин не простил благородства, как не прощал он грамотности тем, кто ему же помогал находить ошибки».\n\nПриведите в сочинении два примера-иллюстрации из прочитанного текста, подтверждающих Ваши рассуждения.\n\nПриводя примеры, указывайте номера нужных предложений или применяйте цитирование.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой пересказанный или полностью переписанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком.\n\n3. Напишите сочинение-рассуждение на тему «Как характеризуют человека его нравственные ценности?». Дайте обоснованный ответ на вопрос, сформулированный в теме сочинения.\n\nПриведите в сочинении два примера, подтверждающих Ваши рассуждения: один пример — из прочитанного текста, а другой — из прочитанного текста или из Вашего жизненного опыта. (Не учитываются примеры, источниками которых являются комикс, аниме, манга, фанфик, графический роман, компьютерная игра и другие подобные виды представления информации.) Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой пересказанный или полностью переписанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком.",
          "correctAnswer": "",
          "answerType": "long"
        }
      ]
    },
    {
      "id": 4,
      "name": "Вариант 4",
      "questions": [
        {
          "id": 1,
          "text": "Укажите варианты ответов, в которых верно определена грамматическая основа в одном из предложений или в одной из частей сложного предложения текста. Запишите номера ответов.",
          "body": "(1) На рассвете туман стелился над лугом и медленно уходил к реке.\n(2) В низине были слышны голоса пастухов.\n(3) Колокольчики, верные приметы лета, звенели под ветром.\n(4) Люди, которые шли по тропе, разговаривали вполголоса.\n(5) Утро казалось особенно свежим.\n\n1) туман стелился (предложение 1)\n2) были слышны голоса (предложение 2)\n3) приметы звенели (предложение 3)\n4) которые шли (предложение 4)\n5) утро казалось (предложение 5)",
          "correctAnswer": "145",
          "answerType": "short"
        },
        {
          "id": 2,
          "text": "Укажите варианты ответов, в которых даны верные характеристики предложений текста. Запишите номера ответов.",
          "body": "(1) На рассвете туман стелился над лугом и медленно уходил к реке.\n(2) В низине были слышны голоса пастухов.\n(3) Колокольчики, верные приметы лета, звенели под ветром.\n(4) Люди, которые шли по тропе, разговаривали вполголоса.\n(5) Утро казалось особенно свежим.\n\n1) В предложении 1 есть однородные сказуемые.\n2) Предложение 2 односоставное назывное.\n3) Предложение 3 осложнено приложением.\n4) В предложении 4 есть придаточное определительное.\n5) Предложение 5 сложноподчинённое.",
          "correctAnswer": "134",
          "answerType": "short"
        },
        {
          "id": 3,
          "text": "Установите соответствие между пунктуационными правилами и предложениями, которые могут служить примерами для приведённых правил. Запишите цифры в порядке АБВ.",
          "body": "ПУНКТУАЦИОННЫЕ ПРАВИЛА\n\nА) Между подлежащим и сказуемым ставится тире.\nБ) Между частями сложного бессоюзного предложения ставится двоеточие, если вторая часть указывает на причину.\nВ) Между частями сложносочинённого предложения ставится запятая.\n\nПРЕДЛОЖЕНИЯ\n\n1) Знание — сила.\n2) Я ускорил шаг: начинался дождь.\n3) Небо потемнело, и вдали сверкнула молния.\n4) Когда стемнело, мы вернулись домой.\n5) Ветер шевелил листья берёз.",
          "correctAnswer": "123",
          "answerType": "short"
        },
        {
          "id": 4,
          "text": "Расставьте знаки препинания. Укажите цифры, на месте которых должно стоять тире.",
          "body": "Старый дуб (1) хранитель этой поляны. Его ветви (2) широкие и крепкие. Лучшее время для прогулки здесь (3) раннее утро. За холмом виднелась деревня (4) и полоска леса. Тишина вокруг (5) редкая удача для городского человека.",
          "correctAnswer": "135",
          "answerType": "short"
        },
        {
          "id": 5,
          "text": "Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера ответов.",
          "body": "1) ПРИГОРОДНЫЙ — приставка ПРИ- обозначает расположение рядом.\n2) РАСШИТЬ — на конце приставки перед звонким согласным пишется С.\n3) ЦЫФРА — после Ц в корне пишется Ы.\n4) НЕ ЗАКОНЧЕННАЯ ВОВРЕМЯ работа — причастие с зависимым словом пишется раздельно.\n5) КАСАТЬСЯ — в корне пишется А, потому что есть суффикс -А-.",
          "correctAnswer": "145",
          "answerType": "short"
        },
        {
          "id": 6,
          "text": "Прочитайте текст. Вставьте пропущенные буквы. Укажите все цифры, на месте которых пишется буква О.",
          "body": "Мы подошли к зар(1)..слям у реки, прик(2)..снулись к влажной траве и увидели, как в тр(3)..стнике качается лодка. Вдруг из-за обл(4)..ков вышло солнце и всё оз(5)..рилось светом.",
          "correctAnswer": "12345",
          "answerType": "short"
        },
        {
          "id": 7,
          "text": "Раскройте скобки и запишите слово в соответствующей форме, соблюдая нормы современного русского литературного языка.",
          "body": "До крепости оставалось менее (девятьсот) метров.",
          "correctAnswer": "девятисот",
          "answerType": "short"
        },
        {
          "id": 8,
          "text": "Синтаксический анализ. Замените словосочетание, построенное на основе управления, синонимичным словосочетанием со связью примыкание. Напишите получившееся словосочетание, соблюдая нормы современного русского литературного языка.",
          "body": "Замените словосочетание «смотрел с удивлением» синонимичным словосочетанием со связью примыкание.",
          "correctAnswer": "смотрел удивлённо",
          "answerType": "short"
        },
        {
          "id": 9,
          "text": "Анализ содержания текста. Какие из высказываний соответствуют содержанию текста? Укажите номера ответов.",
          "body": "(1) Утро перед школьной ярмаркой выдалось суматошным. (2) Мы с одноклассниками таскали столы, развешивали плакаты и спорили из-за того, где лучше поставить коробку с выпечкой. (3) Больше всех волновалась Лиза: именно ей поручили объявлять начало ярмарки. (4) Обычно она говорила легко и уверенно, но в тот день почему-то сбивалась на каждом слове. (5) За час до открытия Лиза призналась мне, что боится выступать перед родителями и учителями. (6) Я удивился: до этого она всегда казалась человеком, которому море по колено. (7) Тогда мы ушли в пустой класс и начали репетировать. (8) Сначала Лиза читала текст тихо и не поднимала глаз. (9) Потом голос её стал ровнее, а в конце она даже улыбнулась. (10) Когда ярмарка началась, Лиза вышла к микрофону и без запинки произнесла всё объявление. (11) После этого она смеялась и говорила, что страх оказался гораздо меньше, чем рисовало воображение.\n\n1) Лиза совсем не переживала перед выступлением.\n2) Рассказчик помог Лизе подготовиться.\n3) Лиза отказалась выходить к микрофону.\n4) После репетиции девушка почувствовала себя увереннее.\n5) Ярмарку отменили из-за волнения Лизы.",
          "correctAnswer": "24",
          "answerType": "short"
        },
        {
          "id": 10,
          "text": "Анализ средств выразительности. Укажите варианты ответов, в которых средством выразительности речи является фразеологизм.",
          "body": "(1) Утро перед школьной ярмаркой выдалось суматошным. (2) Мы с одноклассниками таскали столы, развешивали плакаты и спорили из-за того, где лучше поставить коробку с выпечкой. (3) Больше всех волновалась Лиза: именно ей поручили объявлять начало ярмарки. (4) Обычно она говорила легко и уверенно, но в тот день почему-то сбивалась на каждом слове. (5) За час до открытия Лиза призналась мне, что боится выступать перед родителями и учителями. (6) Я удивился: до этого она всегда казалась человеком, которому море по колено. (7) Тогда мы ушли в пустой класс и начали репетировать. (8) Сначала Лиза читала текст тихо и не поднимала глаз. (9) Потом голос её стал ровнее, а в конце она даже улыбнулась. (10) Когда ярмарка началась, Лиза вышла к микрофону и без запинки произнесла всё объявление. (11) После этого она смеялась и говорила, что страх оказался гораздо меньше, чем рисовало воображение.\n\n1) Утро перед школьной ярмаркой выдалось суматошным.\n2) До этого она всегда казалась человеком, которому море по колено.\n3) Тогда мы ушли в пустой класс и начали репетировать.\n4) Сначала Лиза читала текст тихо и не поднимала глаз.\n5) Когда ярмарка началась, Лиза вышла к микрофону и без запинки произнесла всё объявление.",
          "correctAnswer": "24",
          "answerType": "short"
        },
        {
          "id": 11,
          "text": "Лексический анализ. Выпишите синоним из указанного диапазона предложений.",
          "body": "(1) Утро перед школьной ярмаркой выдалось суматошным. (2) Мы с одноклассниками таскали столы, развешивали плакаты и спорили из-за того, где лучше поставить коробку с выпечкой. (3) Больше всех волновалась Лиза: именно ей поручили объявлять начало ярмарки. (4) Обычно она говорила легко и уверенно, но в тот день почему-то сбивалась на каждом слове. (5) За час до открытия Лиза призналась мне, что боится выступать перед родителями и учителями. (6) Я удивился: до этого она всегда казалась человеком, которому море по колено. (7) Тогда мы ушли в пустой класс и начали репетировать. (8) Сначала Лиза читала текст тихо и не поднимала глаз. (9) Потом голос её стал ровнее, а в конце она даже улыбнулась. (10) Когда ярмарка началась, Лиза вышла к микрофону и без запинки произнесла всё объявление. (11) После этого она смеялась и говорила, что страх оказался гораздо меньше, чем рисовало воображение.\n\nСреди предложений 3–11 найдите синоним к слову БОЯЗНЬ. Выпишите этот синоним.",
          "correctAnswer": "страх",
          "answerType": "short"
        },
        {
          "id": 12,
          "text": "Используя прочитанный текст, выполните на отдельном листе ТОЛЬКО ОДНО из заданий (1, 2 или 3). Перед написанием сочинения запишите номер выбранного задания (1, 2 или 3).",
          "body": "1. Напишите сочинение-рассуждение на тему: «Какие средства языка использовал автор, чтобы создать образы мальчишек?».\n\nПриведите в сочинении два примера из прочитанного текста, подтверждающих Ваши рассуждения. Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой полностью переписанный или пересказанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком.\n\n2. Напишите сочинение-рассуждение. Объясните, как Вы понимаете смысл смысл финала текста: «Но он рад был происшествию, потому что Витёк его зауважал и Сивка оказался Сивкой, а не чем-то вроде...».\n\nПриведите в сочинении два примера из прочитанного текста, подтверждающих Ваши рассуждения. Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой полностью переписанный или пересказанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком.\n\n3. Напишите сочинение-рассуждение на тему «Как можно завоевать уважение?». Дайте обоснованный ответ на вопрос, сформулированный в теме сочинения.\n\nПриведите в сочинении два примера, подтверждающих Ваши рассуждения: один пример — из прочитанного текста, а другой — из прочитанного текста или из Вашего жизненного опыта. (Не учитываются примеры, источниками которых являются комикс, аниме, манга, фанфик, графический роман, компьютерная игра и другие подобные виды представления информации.) Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой пересказанный или полностью переписанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком.",
          "correctAnswer": "",
          "answerType": "long"
        }
      ]
    },
    {
      "id": 5,
      "name": "Вариант 5",
      "questions": [
        {
          "id": 1,
          "text": "Укажите варианты ответов, в которых верно определена грамматическая основа в одном из предложений или в одной из частей сложного предложения текста. Запишите номера ответов.",
          "body": "(1) Вечерний поезд подошёл к станции и остановился у второго пути.\n(2) В окнах были видны сонные пассажиры.\n(3) Проводники, привычные к ночным рейсам, быстро проверяли билеты.\n(4) Люди, которые приехали издалека, выходили с тяжёлыми сумками.\n(5) Перрон казался бесконечным.\n\n1) поезд подошёл (предложение 1)\n2) были видны пассажиры (предложение 2)\n3) привычные проверяли (предложение 3)\n4) которые приехали (предложение 4)\n5) перрон казался (предложение 5)",
          "correctAnswer": "145",
          "answerType": "short"
        },
        {
          "id": 2,
          "text": "Укажите варианты ответов, в которых даны верные характеристики предложений текста. Запишите номера ответов.",
          "body": "(1) Вечерний поезд подошёл к станции и остановился у второго пути.\n(2) В окнах были видны сонные пассажиры.\n(3) Проводники, привычные к ночным рейсам, быстро проверяли билеты.\n(4) Люди, которые приехали издалека, выходили с тяжёлыми сумками.\n(5) Перрон казался бесконечным.\n\n1) В предложении 1 есть однородные сказуемые.\n2) Предложение 2 является односоставным безличным.\n3) Предложение 3 осложнено обособленным определением.\n4) В предложении 4 есть придаточное определительное.\n5) Предложение 5 является сложным.",
          "correctAnswer": "134",
          "answerType": "short"
        },
        {
          "id": 3,
          "text": "Установите соответствие между пунктуационными правилами и предложениями, которые могут служить примерами для приведённых правил. Запишите цифры в порядке АБВ.",
          "body": "ПУНКТУАЦИОННЫЕ ПРАВИЛА\n\nА) Между подлежащим и сказуемым ставится тире.\nБ) Между частями сложного бессоюзного предложения ставится двоеточие, если вторая часть поясняет первую.\nВ) В сложноподчинённом предложении между главным и придаточным предложением ставится запятая.\n\nПРЕДЛОЖЕНИЯ\n\n1) Моё правило — говорить правду.\n2) Я понял: возвращаться поздно.\n3) Когда погас свет, зал замер.\n4) Ночь опустилась быстро, и город стих.\n5) На крыльце сидела кошка.",
          "correctAnswer": "123",
          "answerType": "short"
        },
        {
          "id": 4,
          "text": "Расставьте знаки препинания. Укажите цифры, на месте которых должно стоять тире.",
          "body": "Лучший отдых для меня (1) поездка к морю. Моё любимое время там (2) раннее утро. Шум волн (3) привычная музыка побережья. На пляже лежали лодки (4) и мокрые сети. Возвращение домой всегда (5) небольшая грусть.",
          "correctAnswer": "1235",
          "answerType": "short"
        },
        {
          "id": 5,
          "text": "Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера ответов.",
          "body": "1) ПРИГОТОВИТЬ — приставка ПРИ- обозначает неполноту действия.\n2) БЕЗВКУСНЫЙ — на конце приставки перед глухим согласным пишется С.\n3) ЦЫГАН — написание Ы после Ц является исключением.\n4) НЕ ДОЧИТАННАЯ КНИГА — краткое причастие пишется с одной Н.\n5) КОСНУЛСЯ — в корне с чередованием пишется О, если нет суффикса -А-.",
          "correctAnswer": "235",
          "answerType": "short"
        },
        {
          "id": 6,
          "text": "Прочитайте текст. Вставьте пропущенные буквы. Укажите все цифры, на месте которых пишется буква О.",
          "body": "Утром мы прик(1)..снулись к холодной воде, затем прошли по тр(2)..пинке к выс(3)..кому берегу и увидели, как над морем разг(4)..рается заря. Ветер дон(5)..сил запах соли.",
          "correctAnswer": "12345",
          "answerType": "short"
        },
        {
          "id": 7,
          "text": "Раскройте скобки и запишите слово в соответствующей форме, соблюдая нормы современного русского литературного языка.",
          "body": "До финиша оставалось около (четыреста) метров.",
          "correctAnswer": "четырёхсот",
          "answerType": "short"
        },
        {
          "id": 8,
          "text": "Синтаксический анализ. Замените словосочетание, построенное на основе управления, синонимичным словосочетанием со связью примыкание. Напишите получившееся словосочетание, соблюдая нормы современного русского литературного языка.",
          "body": "Замените словосочетание «говорил с улыбкой» синонимичным словосочетанием со связью примыкание.",
          "correctAnswer": "говорил улыбаясь",
          "answerType": "short"
        },
        {
          "id": 9,
          "text": "Анализ содержания текста. Какие из высказываний соответствуют содержанию текста? Укажите номера ответов.",
          "body": "(1) В детстве я терпеть не мог вставать рано, но летом всё менялось. (2) Стоило деду тихо постучать в дверь, как я уже натягивал одежду и выбегал во двор. (3) Мы шли на рыбалку к старому пруду за деревней. (4) Дорога занимала минут двадцать, и за это время дед успевал рассказать мне одну короткую историю из своей юности. (5) На берегу он никогда не суетился: медленно раскладывал снасти, проверял поплавки и смотрел на воду так, будто вёл с ней разговор. (6) Я же сначала не мог усидеть на месте и каждые две минуты спрашивал, скоро ли начнётся клёв. (7) Дед только улыбался и говорил, что рыбалка любит терпеливых. (8) Однажды мне действительно повезло: поплавок дёрнулся, ушёл под воду, и я вытащил свою первую большую рыбу. (9) С той минуты я понял, почему дед так дорожил этими утренними походами. (10) Для него важна была не только добыча, но и тишина, в которой человек остаётся наедине с собой.\n\n1) Рассказчик летом с удовольствием вставал рано.\n2) Дед спешил и нервничал на берегу.\n3) Рассказчик сразу умел долго ждать клёва.\n4) Герой поймал свою первую большую рыбу.\n5) Для деда на рыбалке была важна только добыча.",
          "correctAnswer": "14",
          "answerType": "short"
        },
        {
          "id": 10,
          "text": "Анализ средств выразительности. Укажите варианты ответов, в которых средством выразительности речи является фразеологизм.",
          "body": "(1) В детстве я терпеть не мог вставать рано, но летом всё менялось. (2) Стоило деду тихо постучать в дверь, как я уже натягивал одежду и выбегал во двор. (3) Мы шли на рыбалку к старому пруду за деревней. (4) Дорога занимала минут двадцать, и за это время дед успевал рассказать мне одну короткую историю из своей юности. (5) На берегу он никогда не суетился: медленно раскладывал снасти, проверял поплавки и смотрел на воду так, будто вёл с ней разговор. (6) Я же сначала не мог усидеть на месте и каждые две минуты спрашивал, скоро ли начнётся клёв. (7) Дед только улыбался и говорил, что рыбалка любит терпеливых. (8) Однажды мне действительно повезло: поплавок дёрнулся, ушёл под воду, и я вытащил свою первую большую рыбу. (9) С той минуты я понял, почему дед так дорожил этими утренними походами. (10) Для него важна была не только добыча, но и тишина, в которой человек остаётся наедине с собой.\n\n1) В детстве я терпеть не мог вставать рано.\n2) Мы шли на рыбалку к старому пруду за деревней.\n3) Я же сначала не мог усидеть на месте.\n4) Поплавок дёрнулся, ушёл под воду.\n5) Человек остаётся наедине с собой.",
          "correctAnswer": "13",
          "answerType": "short"
        },
        {
          "id": 11,
          "text": "Лексический анализ. Выпишите синоним из указанного диапазона предложений.",
          "body": "(1) В детстве я терпеть не мог вставать рано, но летом всё менялось. (2) Стоило деду тихо постучать в дверь, как я уже натягивал одежду и выбегал во двор. (3) Мы шли на рыбалку к старому пруду за деревней. (4) Дорога занимала минут двадцать, и за это время дед успевал рассказать мне одну короткую историю из своей юности. (5) На берегу он никогда не суетился: медленно раскладывал снасти, проверял поплавки и смотрел на воду так, будто вёл с ней разговор. (6) Я же сначала не мог усидеть на месте и каждые две минуты спрашивал, скоро ли начнётся клёв. (7) Дед только улыбался и говорил, что рыбалка любит терпеливых. (8) Однажды мне действительно повезло: поплавок дёрнулся, ушёл под воду, и я вытащил свою первую большую рыбу. (9) С той минуты я понял, почему дед так дорожил этими утренними походами. (10) Для него важна была не только добыча, но и тишина, в которой человек остаётся наедине с собой.\n\nСреди предложений 5–10 найдите синоним к слову ДОБЫЧА. Выпишите этот синоним.",
          "correctAnswer": "рыбу",
          "answerType": "short"
        },
        {
          "id": 12,
          "text": "Используя прочитанный текст, выполните на отдельном листе ТОЛЬКО ОДНО из заданий (13.1, 13.2 или 13.3).",
          "body": "13.1 Напишите сочинение-рассуждение на тему «Какую роль в тексте играют олицетворения?».\n\nДайте ответ на вопрос, сформулированный в теме сочинения.\n\nПриведите в сочинении два примера из прочитанного текста, подтверждающих Ваши рассуждения. Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nСделайте вывод на основе Ваших рассуждений.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой полностью переписанный или пересказанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком, соблюдая нормы современного русского литературного языка.\n\n13.2 Напишите сочинение-рассуждение. Объясните, как Вы понимаете финал данного текста: «Он бежал обратно к музыкальному училищу, к скрипке, к самому себе».\n\nДайте ответ на вопрос, сформулированный в теме сочинения.\n\nПриведите в сочинении два примера из прочитанного текста, подтверждающих Ваши рассуждения. Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nСделайте вывод на основе Ваших рассуждений.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой полностью переписанный или пересказанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком, соблюдая нормы современного русского литературного языка.\n\n13.3 Напишите сочинение-рассуждение на тему «Почему важно оставаться верным своим убеждениям?».\n\nДайте ответ на вопрос, сформулированный в теме сочинения.\n\nПриведите в сочинении два примера из прочитанного текста, подтверждающих Ваши рассуждения. Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nСделайте вывод на основе Ваших рассуждений.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой полностью переписанный или пересказанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком, соблюдая нормы современного русского литературного языка.",
          "correctAnswer": "",
          "answerType": "long"
        }
      ]
    },
    {
      "id": 6,
      "name": "Вариант 6",
      "questions": [
        {
          "id": 1,
          "text": "Укажите варианты ответов, в которых верно определена грамматическая основа в одном из предложений или в одной из частей сложного предложения текста. Запишите номера ответов.",
          "body": "(1) После дождя дорога блестела и тянулась к лесу.\n(2) У обочины были разбросаны мокрые листья.\n(3) Воробьи, вечные спутники деревни, шумели под крышей.\n(4) Люди, которые спешили на автобус, перепрыгивали через лужи.\n(5) Утро казалось прохладным.\n\n1) дорога блестела (предложение 1)\n2) были разбросаны листья (предложение 2)\n3) спутники шумели (предложение 3)\n4) которые спешили (предложение 4)\n5) утро казалось (предложение 5)",
          "correctAnswer": "145",
          "answerType": "short"
        },
        {
          "id": 2,
          "text": "Укажите варианты ответов, в которых даны верные характеристики предложений текста. Запишите номера ответов.",
          "body": "(1) После дождя дорога блестела и тянулась к лесу.\n(2) У обочины были разбросаны мокрые листья.\n(3) Воробьи, вечные спутники деревни, шумели под крышей.\n(4) Люди, которые спешили на автобус, перепрыгивали через лужи.\n(5) Утро казалось прохладным.\n\n1) В предложении 1 есть однородные сказуемые.\n2) Предложение 2 односоставное безличное.\n3) Предложение 3 осложнено приложением.\n4) В предложении 4 есть придаточное определительное.\n5) Предложение 5 сложное.",
          "correctAnswer": "134",
          "answerType": "short"
        },
        {
          "id": 3,
          "text": "Установите соответствие между пунктуационными правилами и предложениями, которые могут служить примерами для приведённых правил. Запишите цифры в порядке АБВ.",
          "body": "ПУНКТУАЦИОННЫЕ ПРАВИЛА\n\nА) Между подлежащим и сказуемым ставится тире.\nБ) Между частями сложного бессоюзного предложения ставится двоеточие, если вторая часть поясняет первую.\nВ) Между частями сложносочинённого предложения ставится запятая.\n\nПРЕДЛОЖЕНИЯ\n\n1) Задача — найти верное решение.\n2) Я замолчал: возражать было нечего.\n3) Солнце село, и на улице быстро похолодало.\n4) Когда подошёл автобус, люди оживились.\n5) На подоконнике стояли цветы.",
          "correctAnswer": "123",
          "answerType": "short"
        },
        {
          "id": 4,
          "text": "Расставьте знаки препинания. Укажите цифры, на месте которых должно стоять тире.",
          "body": "Главное в дороге (1) удобная обувь. Первый привал (2) у старого дуба. Наша задача (3) пройти перевал до темноты. У ручья росла ольха (4) и густой орешник. Холодная вода (5) настоящее спасение в жаркий день.",
          "correctAnswer": "1235",
          "answerType": "short"
        },
        {
          "id": 5,
          "text": "Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера ответов.",
          "body": "1) ПРИШКОЛЬНЫЙ — приставка ПРИ- обозначает близость.\n2) БЕСЦЕННЫЙ — на конце приставки перед глухим согласным пишется З.\n3) ЦЫПЛЁНОК — написание Ы после Ц является исключением.\n4) НЕ ПРОЧИТАННАЯ ДО КОНЦА книга — причастие с зависимым словом пишется раздельно.\n5) КАСАНИЕ — в корне пишется А, потому что есть суффикс -А-.",
          "correctAnswer": "134",
          "answerType": "short"
        },
        {
          "id": 6,
          "text": "Прочитайте текст. Вставьте пропущенные буквы. Укажите все цифры, на месте которых пишется буква О.",
          "body": "Мы к(1)..снулись мокрой травы, прошли по тр(2)..пе к лесу и увидели, как из-за хм(3)..р показалось солнце. Вск(4)..ре на листьях заг(5)..релись капли дождя.",
          "correctAnswer": "12345",
          "answerType": "short"
        },
        {
          "id": 7,
          "text": "Раскройте скобки и запишите слово в соответствующей форме, соблюдая нормы современного русского литературного языка.",
          "body": "В лагерь приехало около (пятьсот) человек.",
          "correctAnswer": "пятисот",
          "answerType": "short"
        },
        {
          "id": 8,
          "text": "Синтаксический анализ. Замените словосочетание, построенное на основе управления, синонимичным словосочетанием со связью примыкание. Напишите получившееся словосочетание, соблюдая нормы современного русского литературного языка.",
          "body": "Замените словосочетание «смеялся без удержу» синонимичным словосочетанием со связью примыкание.",
          "correctAnswer": "смеялся неудержимо",
          "answerType": "short"
        },
        {
          "id": 9,
          "text": "Анализ содержания текста. Какие из высказываний соответствуют содержанию текста? Укажите номера ответов.",
          "body": "(1) В нашей школе был учитель труда, которого мы сначала побаивались. (2) Он говорил мало, но смотрел так, что даже самые шумные ребята сразу притихали. (3) На первом уроке он положил на стол старый деревянный самолёт и сказал, что вещь может пережить человека, если сделана на совесть. (4) Эти слова тогда показались мне слишком серьёзными. (5) Но через несколько занятий я заметил, что он не терпит только одного — равнодушия. (6) Ошибаться он разрешал, переделывать заставлял, а вот делать кое-как не позволял никому. (7) Однажды я испортил заготовку для табурета и уже хотел спрятать её под верстак. (8) Учитель увидел это, молча подошёл и велел начать заново. (9) После урока он задержал меня и неожиданно помог выбрать новую доску. (10) Тогда я понял, что строгость у него не от злости, а от уважения к делу и к нам.\n\n1) Учитель труда любил небрежную работу.\n2) Сначала ученики побаивались учителя.\n3) Учитель запрещал ошибаться.\n4) Он помог рассказчику исправить ситуацию.\n5) Герой решил больше не ходить на труд.",
          "correctAnswer": "24",
          "answerType": "short"
        },
        {
          "id": 10,
          "text": "Анализ средств выразительности. Укажите варианты ответов, в которых средством выразительности речи является фразеологизм.",
          "body": "(1) В нашей школе был учитель труда, которого мы сначала побаивались. (2) Он говорил мало, но смотрел так, что даже самые шумные ребята сразу притихали. (3) На первом уроке он положил на стол старый деревянный самолёт и сказал, что вещь может пережить человека, если сделана на совесть. (4) Эти слова тогда показались мне слишком серьёзными. (5) Но через несколько занятий я заметил, что он не терпит только одного — равнодушия. (6) Ошибаться он разрешал, переделывать заставлял, а вот делать кое-как не позволял никому. (7) Однажды я испортил заготовку для табурета и уже хотел спрятать её под верстак. (8) Учитель увидел это, молча подошёл и велел начать заново. (9) После урока он задержал меня и неожиданно помог выбрать новую доску. (10) Тогда я понял, что строгость у него не от злости, а от уважения к делу и к нам.\n\n1) В нашей школе был учитель труда.\n2) Вещь может пережить человека, если сделана на совесть.\n3) Эти слова тогда показались мне слишком серьёзными.\n4) Я уже хотел спрятать её под верстак.\n5) Тогда я понял, что строгость у него не от злости.",
          "correctAnswer": "2",
          "answerType": "short"
        },
        {
          "id": 11,
          "text": "Лексический анализ. Выпишите синоним из указанного диапазона предложений.",
          "body": "(1) В нашей школе был учитель труда, которого мы сначала побаивались. (2) Он говорил мало, но смотрел так, что даже самые шумные ребята сразу притихали. (3) На первом уроке он положил на стол старый деревянный самолёт и сказал, что вещь может пережить человека, если сделана на совесть. (4) Эти слова тогда показались мне слишком серьёзными. (5) Но через несколько занятий я заметил, что он не терпит только одного — равнодушия. (6) Ошибаться он разрешал, переделывать заставлял, а вот делать кое-как не позволял никому. (7) Однажды я испортил заготовку для табурета и уже хотел спрятать её под верстак. (8) Учитель увидел это, молча подошёл и велел начать заново. (9) После урока он задержал меня и неожиданно помог выбрать новую доску. (10) Тогда я понял, что строгость у него не от злости, а от уважения к делу и к нам.\n\nСреди предложений 5–10 найдите синоним к слову СУРОВОСТЬ из предложения 10. Выпишите этот синоним.",
          "correctAnswer": "строгость",
          "answerType": "short"
        },
        {
          "id": 12,
          "text": "Используя прочитанный текст, выполните на отдельном листе ТОЛЬКО ОДНО из заданий (1, 2 или 3). Перед написанием сочинения запишите номер выбранного задания (1, 2 или 3).",
          "body": "1. Напишите сочинение-рассуждение на тему «Какие средства языка использовал автор для создания образа Сени Голубкина?».\n\nПриведите в сочинении два примера из прочитанного текста, подтверждающих Ваши рассуждения. Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой полностью переписанный или пересказанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком.\n\n2. Напишите сочинение-рассуждение. Объясните, как Вы понимаете смысл фрагмента текста: «Он не проникся благодарностью к Ване Белову, напротив, именно с тех пор и невзлюбил его. Голубкин не простил благородства, как не прощал он грамотности тем, кто ему же помогал находить ошибки».\n\nПриведите в сочинении два примера-иллюстрации из прочитанного текста, подтверждающих Ваши рассуждения.\n\nПриводя примеры, указывайте номера нужных предложений или применяйте цитирование.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой пересказанный или полностью переписанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком.\n\n3. Напишите сочинение-рассуждение на тему «Как характеризуют человека его нравственные ценности?». Дайте обоснованный ответ на вопрос, сформулированный в теме сочинения.\n\nПриведите в сочинении два примера, подтверждающих Ваши рассуждения: один пример — из прочитанного текста, а другой — из прочитанного текста или из Вашего жизненного опыта. (Не учитываются примеры, источниками которых являются комикс, аниме, манга, фанфик, графический роман, компьютерная игра и другие подобные виды представления информации.) Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой пересказанный или полностью переписанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком.",
          "correctAnswer": "",
          "answerType": "long"
        }
      ]
    },
    {
      "id": 7,
      "name": "Вариант 7",
      "questions": [
        {
          "id": 1,
          "text": "Укажите варианты ответов, в которых верно определена грамматическая основа в одном из предложений или в одной из частей сложного предложения текста. Запишите номера ответов.",
          "body": "(1) Снег ложился на крыши и быстро таял у фонарей.\n(2) На площади были слышны шаги редких прохожих.\n(3) Деревья, безмолвные свидетели зимы, стояли неподвижно.\n(4) Люди, которые торопились домой, прятали лица в шарфы.\n(5) Вечер казался особенно тихим.\n\n1) снег ложился (предложение 1)\n2) были слышны шаги (предложение 2)\n3) свидетели стояли (предложение 3)\n4) которые торопились (предложение 4)\n5) вечер казался (предложение 5)",
          "correctAnswer": "145",
          "answerType": "short"
        },
        {
          "id": 2,
          "text": "Укажите варианты ответов, в которых даны верные характеристики предложений текста. Запишите номера ответов.",
          "body": "(1) Снег ложился на крыши и быстро таял у фонарей.\n(2) На площади были слышны шаги редких прохожих.\n(3) Деревья, безмолвные свидетели зимы, стояли неподвижно.\n(4) Люди, которые торопились домой, прятали лица в шарфы.\n(5) Вечер казался особенно тихим.\n\n1) В предложении 1 есть однородные сказуемые.\n2) Предложение 2 односоставное назывное.\n3) Предложение 3 осложнено приложением.\n4) В предложении 4 есть придаточное определительное.\n5) Предложение 5 является сложным.",
          "correctAnswer": "134",
          "answerType": "short"
        },
        {
          "id": 3,
          "text": "Установите соответствие между пунктуационными правилами и предложениями, которые могут служить примерами для приведённых правил. Запишите цифры в порядке АБВ.",
          "body": "ПУНКТУАЦИОННЫЕ ПРАВИЛА\n\nА) Между подлежащим и сказуемым ставится тире.\nБ) Между частями сложного бессоюзного предложения ставится двоеточие, если вторая часть указывает на причину.\nВ) В сложноподчинённом предложении между главным и придаточным предложением ставится запятая.\n\nПРЕДЛОЖЕНИЯ\n\n1) Доброта — редкий дар.\n2) Я ускорил шаг: на улице становилось темнее.\n3) Когда начался снег, город будто притих.\n4) Ветер усилился, и хлопья снега закружились ещё быстрее.\n5) Вдалеке горели огни.",
          "correctAnswer": "123",
          "answerType": "short"
        },
        {
          "id": 4,
          "text": "Расставьте знаки препинания. Укажите цифры, на месте которых должно стоять тире.",
          "body": "Наше главное укрытие в непогоду (1) старая беседка. Её крыша (2) надёжная защита от снега. Самая приятная часть зимней прогулки (3) горячий чай из термоса. На дорожке лежали ветки (4) и следы птиц. Зимний парк вечером (5) особый мир.",
          "correctAnswer": "1235",
          "answerType": "short"
        },
        {
          "id": 5,
          "text": "Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера ответов.",
          "body": "1) ПРИШКОЛЬНЫЙ — приставка ПРИ- обозначает близость.\n2) БЕСПЛАТНЫЙ — на конце приставки перед глухим согласным пишется С.\n3) ЦИПОЧКА — после Ц всегда пишется И.\n4) НЕ ЗАМЕЧЕННАЯ МНОЙ ошибка — причастие с зависимым словом пишется раздельно.\n5) КОСИТЬ — в корне с чередованием всегда пишется О.",
          "correctAnswer": "124",
          "answerType": "short"
        },
        {
          "id": 6,
          "text": "Прочитайте текст. Вставьте пропущенные буквы. Укажите все цифры, на месте которых пишется буква О.",
          "body": "Мы прик(1)..снулись к холодному стеклу, увидели, как над гор(2)..дом плывут облака, и вск(3)..ре заметили, что снег перестал идти. На перекрёстке заг(4)..релся зелёный свет, и поток машин снова двинулся вперёд. На обочине ш(5)..рохом поднялась стая воробьёв.",
          "correctAnswer": "12345",
          "answerType": "short"
        },
        {
          "id": 7,
          "text": "Раскройте скобки и запишите слово в соответствующей форме, соблюдая нормы современного русского литературного языка.",
          "body": "В зале было более (триста) человек.",
          "correctAnswer": "трёхсот",
          "answerType": "short"
        },
        {
          "id": 8,
          "text": "Синтаксический анализ. Замените словосочетание, построенное на основе управления, синонимичным словосочетанием со связью примыкание. Напишите получившееся словосочетание, соблюдая нормы современного русского литературного языка.",
          "body": "Замените словосочетание «сказал с досадой» синонимичным словосочетанием со связью примыкание.",
          "correctAnswer": "сказал досадливо",
          "answerType": "short"
        },
        {
          "id": 9,
          "text": "Анализ содержания текста. Какие из высказываний соответствуют содержанию текста? Укажите номера ответов.",
          "body": "(1) Наш класс редко выбирался куда-то вместе, и потому поездка в краеведческий музей казалась почти праздником. (2) По дороге мы шумели, толкались и строили планы, как быстро всё осмотрим и успеем ещё погулять в парке. (3) Но с первых минут экскурсии стало ясно, что спешить здесь не получится. (4) Экскурсовод, пожилой мужчина с тихим голосом, показывал нам самые обычные, на первый взгляд, вещи: старую лампу, потрёпанную шинель, записную книжку. (5) И вдруг за каждым предметом начинала проступать чья-то судьба. (6) Особенно меня поразило письмо молодого солдата, которое он не успел отправить домой. (7) Я поймал себя на том, что уже не смотрю на часы и не думаю о парке. (8) Возвращаясь в автобус, мы говорили гораздо тише, чем утром. (9) Кажется, каждый увозил с собой ощущение, что история — это не параграф в учебнике, а жизни конкретных людей.\n\n1) Класс с самого начала внимательно слушал экскурсовода.\n2) Экскурсия оказалась более интересной, чем ожидали ребята.\n3) Больше всего героя поразило письмо солдата.\n4) После музея школьники шумели ещё сильнее, чем утром.\n5) Герой считал историю чем-то далёким и ненужным даже после экскурсии.",
          "correctAnswer": "23",
          "answerType": "short"
        },
        {
          "id": 10,
          "text": "Анализ средств выразительности. Укажите варианты ответов, в которых средством выразительности речи является фразеологизм.",
          "body": "(1) Наш класс редко выбирался куда-то вместе, и потому поездка в краеведческий музей казалась почти праздником. (2) По дороге мы шумели, толкались и строили планы, как быстро всё осмотрим и успеем ещё погулять в парке. (3) Но с первых минут экскурсии стало ясно, что спешить здесь не получится. (4) Экскурсовод, пожилой мужчина с тихим голосом, показывал нам самые обычные, на первый взгляд, вещи: старую лампу, потрёпанную шинель, записную книжку. (5) И вдруг за каждым предметом начинала проступать чья-то судьба. (6) Особенно меня поразило письмо молодого солдата, которое он не успел отправить домой. (7) Я поймал себя на том, что уже не смотрю на часы и не думаю о парке. (8) Возвращаясь в автобус, мы говорили гораздо тише, чем утром. (9) Кажется, каждый увозил с собой ощущение, что история — это не параграф в учебнике, а жизни конкретных людей.\n\n1) Поездка в краеведческий музей казалась почти праздником.\n2) На первый взгляд, вещи казались обычными.\n3) Я поймал себя на том, что уже не смотрю на часы.\n4) Мы говорили гораздо тише, чем утром.\n5) История — это не параграф в учебнике.",
          "correctAnswer": "23",
          "answerType": "short"
        },
        {
          "id": 11,
          "text": "Лексический анализ. Выпишите синоним из указанного диапазона предложений.",
          "body": "(1) Наш класс редко выбирался куда-то вместе, и потому поездка в краеведческий музей казалась почти праздником. (2) По дороге мы шумели, толкались и строили планы, как быстро всё осмотрим и успеем ещё погулять в парке. (3) Но с первых минут экскурсии стало ясно, что спешить здесь не получится. (4) Экскурсовод, пожилой мужчина с тихим голосом, показывал нам самые обычные, на первый взгляд, вещи: старую лампу, потрёпанную шинель, записную книжку. (5) И вдруг за каждым предметом начинала проступать чья-то судьба. (6) Особенно меня поразило письмо молодого солдата, которое он не успел отправить домой. (7) Я поймал себя на том, что уже не смотрю на часы и не думаю о парке. (8) Возвращаясь в автобус, мы говорили гораздо тише, чем утром. (9) Кажется, каждый увозил с собой ощущение, что история — это не параграф в учебнике, а жизни конкретных людей.\n\nСреди предложений 3–9 найдите синоним к слову СУДЬБА из предложения 5. Выпишите этот синоним.",
          "correctAnswer": "жизни",
          "answerType": "short"
        },
        {
          "id": 12,
          "text": "Используя прочитанный текст, выполните на отдельном листе ТОЛЬКО ОДНО из заданий (1, 2 или 3). Перед написанием сочинения запишите номер выбранного задания (1, 2 или 3).",
          "body": "1. Напишите сочинение-рассуждение на тему: «Какие средства языка использовал автор, чтобы создать образы мальчишек?».\n\nПриведите в сочинении два примера из прочитанного текста, подтверждающих Ваши рассуждения. Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой полностью переписанный или пересказанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком.\n\n2. Напишите сочинение-рассуждение. Объясните, как Вы понимаете смысл смысл финала текста: «Но он рад был происшествию, потому что Витёк его зауважал и Сивка оказался Сивкой, а не чем-то вроде...».\n\nПриведите в сочинении два примера из прочитанного текста, подтверждающих Ваши рассуждения. Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой полностью переписанный или пересказанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком.\n\n3. Напишите сочинение-рассуждение на тему «Как можно завоевать уважение?». Дайте обоснованный ответ на вопрос, сформулированный в теме сочинения.\n\nПриведите в сочинении два примера, подтверждающих Ваши рассуждения: один пример — из прочитанного текста, а другой — из прочитанного текста или из Вашего жизненного опыта. (Не учитываются примеры, источниками которых являются комикс, аниме, манга, фанфик, графический роман, компьютерная игра и другие подобные виды представления информации.) Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой пересказанный или полностью переписанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком.",
          "correctAnswer": "",
          "answerType": "long"
        }
      ]
    },
    {
      "id": 8,
      "name": "Вариант 8",
      "questions": [
        {
          "id": 1,
          "text": "Укажите варианты ответов, в которых верно определена грамматическая основа в одном из предложений или в одной из частей сложного предложения текста. Запишите номера ответов.",
          "body": "(1) С утра ветер гнал тучи и раскачивал верхушки сосен.\n(2) На поляне были разбросаны шишки и сухие ветки.\n(3) Белки, ловкие хозяйки леса, прыгали по стволам.\n(4) Туристы, которые вышли на маршрут раньше всех, уже скрылись за поворотом.\n(5) День обещал быть ясным.\n\n1) ветер гнал (предложение 1)\n2) были разбросаны шишки (предложение 2)\n3) хозяйки прыгали (предложение 3)\n4) которые вышли (предложение 4)\n5) день обещал (предложение 5)",
          "correctAnswer": "145",
          "answerType": "short"
        },
        {
          "id": 2,
          "text": "Укажите варианты ответов, в которых даны верные характеристики предложений текста. Запишите номера ответов.",
          "body": "(1) С утра ветер гнал тучи и раскачивал верхушки сосен.\n(2) На поляне были разбросаны шишки и сухие ветки.\n(3) Белки, ловкие хозяйки леса, прыгали по стволам.\n(4) Туристы, которые вышли на маршрут раньше всех, уже скрылись за поворотом.\n(5) День обещал быть ясным.\n\n1) В предложении 1 есть однородные сказуемые.\n2) Предложение 2 является назывным.\n3) Предложение 3 осложнено приложением.\n4) В предложении 4 есть придаточное определительное.\n5) Предложение 5 бессоюзное сложное.",
          "correctAnswer": "134",
          "answerType": "short"
        },
        {
          "id": 3,
          "text": "Установите соответствие между пунктуационными правилами и предложениями, которые могут служить примерами для приведённых правил. Запишите цифры в порядке АБВ.",
          "body": "ПУНКТУАЦИОННЫЕ ПРАВИЛА\n\nА) Между подлежащим и сказуемым ставится тире.\nБ) Между частями сложного бессоюзного предложения ставится двоеточие, если вторая часть поясняет первую.\nВ) Между частями сложносочинённого предложения ставится запятая.\n\nПРЕДЛОЖЕНИЯ\n\n1) Храбрость — это умение действовать, несмотря на страх.\n2) Я оглянулся: тропа исчезала в тумане.\n3) Дождь закончился, и лес сразу ожил.\n4) Когда вышло солнце, трава заблестела.\n5) На ветке сидела синица.",
          "correctAnswer": "123",
          "answerType": "short"
        },
        {
          "id": 4,
          "text": "Расставьте знаки препинания. Укажите цифры, на месте которых должно стоять тире.",
          "body": "Лучший ориентир в лесу (1) карта и компас. Наш проводник (2) опытный лесник. Главное правило похода (3) не сходить с тропы. Под ногами шуршали листья (4) и ломались сухие ветки. Спокойствие в таких местах (5) важный помощник.",
          "correctAnswer": "1235",
          "answerType": "short"
        },
        {
          "id": 5,
          "text": "Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера ответов.",
          "body": "1) ПРИБЕРЕЖНЫЙ — приставка ПРИ- обозначает близость.\n2) БЕСФОРМЕННЫЙ — на конце приставки перед глухим согласным пишется З.\n3) ЦЫПЛЁНОК — написание Ы после Ц является исключением.\n4) НЕ ВЫУЧЕННОЕ ВОВРЕМЯ правило — причастие с зависимым словом пишется раздельно.\n5) КОСА — в корне с чередованием всегда пишется О.",
          "correctAnswer": "134",
          "answerType": "short"
        },
        {
          "id": 6,
          "text": "Прочитайте текст. Вставьте пропущенные буквы. Укажите все цифры, на месте которых пишется буква О.",
          "body": "Мы прик(1)..снулись к шершавой коре, увидели у тр(2)..пы следы зверя и вск(3)..ре услышали ш(4)..рох в кустах. Над лесом заг(5)..релось солнце, и в кронах запели птицы.",
          "correctAnswer": "12345",
          "answerType": "short"
        },
        {
          "id": 7,
          "text": "Раскройте скобки и запишите слово в соответствующей форме, соблюдая нормы современного русского литературного языка.",
          "body": "На выставке побывало более (двести) человек.",
          "correctAnswer": "двухсот",
          "answerType": "short"
        },
        {
          "id": 8,
          "text": "Синтаксический анализ. Замените словосочетание, построенное на основе управления, синонимичным словосочетанием со связью примыкание. Напишите получившееся словосочетание, соблюдая нормы современного русского литературного языка.",
          "body": "Замените словосочетание «ответил без колебаний» синонимичным словосочетанием со связью примыкание.",
          "correctAnswer": "ответил не колеблясь",
          "answerType": "short"
        },
        {
          "id": 9,
          "text": "Анализ содержания текста. Какие из высказываний соответствуют содержанию текста? Укажите номера ответов.",
          "body": "(1) Когда я впервые попал в волонтёрский центр, мне казалось, что там работают только очень уверенные в себе люди. (2) Я стоял у двери и не решался подойти к столу регистрации. (3) Всё изменилось, когда ко мне подошла девушка в зелёной футболке и просто спросила, умею ли я клеить коробки. (4) Вопрос был таким будничным, что я сразу перестал волноваться. (5) Через десять минут мы уже вместе сортировали книги для сельской библиотеки. (6) Кто-то аккуратно складывал издания по возрасту читателей, кто-то подписывал коробки, кто-то носил их к машине. (7) Работа была несложной, но к концу дня я чувствовал себя так, будто сделал что-то действительно важное. (8) Особенно запомнился момент, когда руководитель центра сказал, что благодаря нам книги поедут туда, где их очень ждут. (9) Тогда я понял простую вещь: помогать людям можно не только громкими поступками.\n\n1) Герой сразу уверенно вошёл и начал работать.\n2) Девушка из центра помогла ему перестать волноваться.\n3) Волонтёры занимались сортировкой книг.\n4) К концу дня герой жалел, что пришёл.\n5) Герой решил, что помогать можно только в исключительных случаях.",
          "correctAnswer": "23",
          "answerType": "short"
        },
        {
          "id": 10,
          "text": "Анализ средств выразительности. Укажите варианты ответов, в которых средством выразительности речи является фразеологизм.",
          "body": "(1) Когда я впервые попал в волонтёрский центр, мне казалось, что там работают только очень уверенные в себе люди. (2) Я стоял у двери и не решался подойти к столу регистрации. (3) Всё изменилось, когда ко мне подошла девушка в зелёной футболке и просто спросила, умею ли я клеить коробки. (4) Вопрос был таким будничным, что я сразу перестал волноваться. (5) Через десять минут мы уже вместе сортировали книги для сельской библиотеки. (6) Кто-то аккуратно складывал издания по возрасту читателей, кто-то подписывал коробки, кто-то носил их к машине. (7) Работа была несложной, но к концу дня я чувствовал себя так, будто сделал что-то действительно важное. (8) Особенно запомнился момент, когда руководитель центра сказал, что благодаря нам книги поедут туда, где их очень ждут. (9) Тогда я понял простую вещь: помогать людям можно не только громкими поступками.\n\n1) Мне казалось, что там работают только очень уверенные в себе люди.\n2) Я стоял у двери и не решался подойти к столу регистрации.\n3) Через десять минут мы уже вместе сортировали книги.\n4) Я чувствовал себя так, будто сделал что-то действительно важное.\n5) Я понял простую вещь.",
          "correctAnswer": "5",
          "answerType": "short"
        },
        {
          "id": 11,
          "text": "Лексический анализ. Выпишите синоним из указанного диапазона предложений.",
          "body": "(1) Когда я впервые попал в волонтёрский центр, мне казалось, что там работают только очень уверенные в себе люди. (2) Я стоял у двери и не решался подойти к столу регистрации. (3) Всё изменилось, когда ко мне подошла девушка в зелёной футболке и просто спросила, умею ли я клеить коробки. (4) Вопрос был таким будничным, что я сразу перестал волноваться. (5) Через десять минут мы уже вместе сортировали книги для сельской библиотеки. (6) Кто-то аккуратно складывал издания по возрасту читателей, кто-то подписывал коробки, кто-то носил их к машине. (7) Работа была несложной, но к концу дня я чувствовал себя так, будто сделал что-то действительно важное. (8) Особенно запомнился момент, когда руководитель центра сказал, что благодаря нам книги поедут туда, где их очень ждут. (9) Тогда я понял простую вещь: помогать людям можно не только громкими поступками.\n\nСреди предложений 1–9 найдите синоним к слову ДЕЛО из предложения 7. Выпишите этот синоним.",
          "correctAnswer": "работа",
          "answerType": "short"
        },
        {
          "id": 12,
          "text": "Используя прочитанный текст, выполните на отдельном листе ТОЛЬКО ОДНО из заданий (13.1, 13.2 или 13.3).",
          "body": "13.1 Напишите сочинение-рассуждение на тему «Какую роль в тексте играют олицетворения?».\n\nДайте ответ на вопрос, сформулированный в теме сочинения.\n\nПриведите в сочинении два примера из прочитанного текста, подтверждающих Ваши рассуждения. Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nСделайте вывод на основе Ваших рассуждений.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой полностью переписанный или пересказанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком, соблюдая нормы современного русского литературного языка.\n\n13.2 Напишите сочинение-рассуждение. Объясните, как Вы понимаете финал данного текста: «Он бежал обратно к музыкальному училищу, к скрипке, к самому себе».\n\nДайте ответ на вопрос, сформулированный в теме сочинения.\n\nПриведите в сочинении два примера из прочитанного текста, подтверждающих Ваши рассуждения. Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nСделайте вывод на основе Ваших рассуждений.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой полностью переписанный или пересказанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком, соблюдая нормы современного русского литературного языка.\n\n13.3 Напишите сочинение-рассуждение на тему «Почему важно оставаться верным своим убеждениям?».\n\nДайте ответ на вопрос, сформулированный в теме сочинения.\n\nПриведите в сочинении два примера из прочитанного текста, подтверждающих Ваши рассуждения. Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nСделайте вывод на основе Ваших рассуждений.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой полностью переписанный или пересказанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком, соблюдая нормы современного русского литературного языка.",
          "correctAnswer": "",
          "answerType": "long"
        }
      ]
    },
    {
      "id": 9,
      "name": "Вариант 9",
      "questions": [
        {
          "id": 1,
          "text": "Укажите варианты ответов, в которых верно определена грамматическая основа в одном из предложений или в одной из частей сложного предложения текста. Запишите номера ответов.",
          "body": "(1) На стадионе загорелись прожекторы и началась тренировка.\n(2) На трибунах были видны несколько зрителей.\n(3) Ребята, будущие чемпионы района, бегали по кругу.\n(4) Те, кто пришёл раньше всех, уже разминались у ворот.\n(5) Вечер обещал быть насыщенным.\n\n1) прожекторы загорелись (предложение 1)\n2) были видны зрителей (предложение 2)\n3) чемпионы бегали (предложение 3)\n4) кто пришёл (предложение 4)\n5) вечер обещал (предложение 5)",
          "correctAnswer": "145",
          "answerType": "short"
        },
        {
          "id": 2,
          "text": "Укажите варианты ответов, в которых даны верные характеристики предложений текста. Запишите номера ответов.",
          "body": "(1) На стадионе загорелись прожекторы и началась тренировка.\n(2) На трибунах были видны несколько зрителей.\n(3) Ребята, будущие чемпионы района, бегали по кругу.\n(4) Те, кто пришёл раньше всех, уже разминались у ворот.\n(5) Вечер обещал быть насыщенным.\n\n1) Предложение 1 сложносочинённое.\n2) Предложение 2 односоставное безличное.\n3) Предложение 3 осложнено приложением.\n4) В предложении 4 есть придаточное определительное.\n5) Предложение 5 является сложным.",
          "correctAnswer": "134",
          "answerType": "short"
        },
        {
          "id": 3,
          "text": "Установите соответствие между пунктуационными правилами и предложениями, которые могут служить примерами для приведённых правил. Запишите цифры в порядке АБВ.",
          "body": "ПУНКТУАЦИОННЫЕ ПРАВИЛА\n\nА) Между подлежащим и сказуемым ставится тире.\nБ) Между частями сложного бессоюзного предложения ставится двоеточие, если вторая часть поясняет первую.\nВ) Между частями сложносочинённого предложения ставится запятая.\n\nПРЕДЛОЖЕНИЯ\n\n1) Спорт — лучший способ проверить характер.\n2) Я остановился: матч уже начался.\n3) Судья дал свисток, и игра сразу ускорилась.\n4) Когда прозвучал финальный сигнал, трибуны загудели.\n5) У ворот стоял запасной вратарь.",
          "correctAnswer": "123",
          "answerType": "short"
        },
        {
          "id": 4,
          "text": "Расставьте знаки препинания. Укажите цифры, на месте которых должно стоять тире.",
          "body": "Главная цель нашей команды (1) победа в турнире. Лучший нападающий сегодня (2) Артём. Его скорость (3) серьёзное преимущество на поле. У кромки беговой дорожки стояли тренеры (4) и запасные игроки. Хорошая разминка перед матчем (5) обязательное условие.",
          "correctAnswer": "1235",
          "answerType": "short"
        },
        {
          "id": 5,
          "text": "Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера ответов.",
          "body": "1) ПРИДОРОЖНЫЙ — приставка ПРИ- обозначает близость.\n2) БЕСПЛАНОВЫЙ — на конце приставки перед глухим согласным пишется С.\n3) ЦИПЛЁНОК — после Ц всегда пишется И.\n4) НЕ СДАННАЯ В СРОК работа — причастие с зависимым словом пишется раздельно.\n5) КОСНУТЬСЯ — в корне с чередованием пишется О, если нет суффикса -А-.",
          "correctAnswer": "1245",
          "answerType": "short"
        },
        {
          "id": 6,
          "text": "Прочитайте текст. Вставьте пропущенные буквы. Укажите все цифры, на месте которых пишется буква О.",
          "body": "Мы прик(1)..снулись к прохладной сетке ворот, потом прошли по тр(2)..пинке к полю и увидели, как над стади(3)..ном заг(4)..релись огни. Вск(5)..ре началась игра.",
          "correctAnswer": "12345",
          "answerType": "short"
        },
        {
          "id": 7,
          "text": "Раскройте скобки и запишите слово в соответствующей форме, соблюдая нормы современного русского литературного языка.",
          "body": "На соревнования приехало более (шестьсот) участников.",
          "correctAnswer": "шестисот",
          "answerType": "short"
        },
        {
          "id": 8,
          "text": "Синтаксический анализ. Замените словосочетание, построенное на основе управления, синонимичным словосочетанием со связью примыкание. Напишите получившееся словосочетание, соблюдая нормы современного русского литературного языка.",
          "body": "Замените словосочетание «бежал без оглядки» синонимичным словосочетанием со связью примыкание.",
          "correctAnswer": "бежал стремительно",
          "answerType": "short"
        },
        {
          "id": 9,
          "text": "Анализ содержания текста. Какие из высказываний соответствуют содержанию текста? Укажите номера ответов.",
          "body": "(1) В прошлом году я записался в школьный беговой клуб скорее из любопытства, чем из любви к спорту. (2) Мне казалось, что тренировки — это скучные круги по стадиону и постоянная усталость. (3) Первые занятия только укрепили это мнение: ноги гудели, дыхание сбивалось, а тренер требовал держать темп. (4) Я уже подумывал бросить всё, но однажды нас вывезли на городской старт. (5) Там я увидел сотни людей разного возраста, которые бежали не ради оценок и не по обязанности. (6) Кто-то хотел победить, кто-то проверял себя, кто-то просто радовался движению. (7) На дистанции я, конечно, не стал первым, но впервые почувствовал азарт и странную лёгкость. (8) После финиша тренер сказал, что главное — не место в протоколе, а привычка не сдаваться раньше времени. (9) С тех пор я стал иначе относиться к бегу и к собственным возможностям.\n\n1) Герой сразу полюбил тренировки.\n2) Сначала бег казался ему скучным и тяжёлым.\n3) На городском старте он стал победителем.\n4) Герой увидел, что люди бегают по разным причинам.\n5) После соревнования его отношение к бегу не изменилось.",
          "correctAnswer": "24",
          "answerType": "short"
        },
        {
          "id": 10,
          "text": "Анализ средств выразительности. Укажите варианты ответов, в которых средством выразительности речи является фразеологизм.",
          "body": "(1) В прошлом году я записался в школьный беговой клуб скорее из любопытства, чем из любви к спорту. (2) Мне казалось, что тренировки — это скучные круги по стадиону и постоянная усталость. (3) Первые занятия только укрепили это мнение: ноги гудели, дыхание сбивалось, а тренер требовал держать темп. (4) Я уже подумывал бросить всё, но однажды нас вывезли на городской старт. (5) Там я увидел сотни людей разного возраста, которые бежали не ради оценок и не по обязанности. (6) Кто-то хотел победить, кто-то проверял себя, кто-то просто радовался движению. (7) На дистанции я, конечно, не стал первым, но впервые почувствовал азарт и странную лёгкость. (8) После финиша тренер сказал, что главное — не место в протоколе, а привычка не сдаваться раньше времени. (9) С тех пор я стал иначе относиться к бегу и к собственным возможностям.\n\n1) Скорее из любопытства, чем из любви к спорту.\n2) Ноги гудели, дыхание сбивалось.\n3) Я уже подумывал бросить всё.\n4) Кто-то просто радовался движению.\n5) Главное — не место в протоколе.",
          "correctAnswer": "3",
          "answerType": "short"
        },
        {
          "id": 11,
          "text": "Лексический анализ. Выпишите синоним из указанного диапазона предложений.",
          "body": "(1) В прошлом году я записался в школьный беговой клуб скорее из любопытства, чем из любви к спорту. (2) Мне казалось, что тренировки — это скучные круги по стадиону и постоянная усталость. (3) Первые занятия только укрепили это мнение: ноги гудели, дыхание сбивалось, а тренер требовал держать темп. (4) Я уже подумывал бросить всё, но однажды нас вывезли на городской старт. (5) Там я увидел сотни людей разного возраста, которые бежали не ради оценок и не по обязанности. (6) Кто-то хотел победить, кто-то проверял себя, кто-то просто радовался движению. (7) На дистанции я, конечно, не стал первым, но впервые почувствовал азарт и странную лёгкость. (8) После финиша тренер сказал, что главное — не место в протоколе, а привычка не сдаваться раньше времени. (9) С тех пор я стал иначе относиться к бегу и к собственным возможностям.\n\nСреди предложений 1–9 найдите синоним к слову ИНТЕРЕС из предложения 1. Выпишите этот синоним.",
          "correctAnswer": "любопытства",
          "answerType": "short"
        },
        {
          "id": 12,
          "text": "Используя прочитанный текст, выполните на отдельном листе ТОЛЬКО ОДНО из заданий (1, 2 или 3). Перед написанием сочинения запишите номер выбранного задания (1, 2 или 3).",
          "body": "1. Напишите сочинение-рассуждение на тему «Какие средства языка использовал автор для создания образа Сени Голубкина?».\n\nПриведите в сочинении два примера из прочитанного текста, подтверждающих Ваши рассуждения. Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой полностью переписанный или пересказанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком.\n\n2. Напишите сочинение-рассуждение. Объясните, как Вы понимаете смысл фрагмента текста: «Он не проникся благодарностью к Ване Белову, напротив, именно с тех пор и невзлюбил его. Голубкин не простил благородства, как не прощал он грамотности тем, кто ему же помогал находить ошибки».\n\nПриведите в сочинении два примера-иллюстрации из прочитанного текста, подтверждающих Ваши рассуждения.\n\nПриводя примеры, указывайте номера нужных предложений или применяйте цитирование.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой пересказанный или полностью переписанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком.\n\n3. Напишите сочинение-рассуждение на тему «Как характеризуют человека его нравственные ценности?». Дайте обоснованный ответ на вопрос, сформулированный в теме сочинения.\n\nПриведите в сочинении два примера, подтверждающих Ваши рассуждения: один пример — из прочитанного текста, а другой — из прочитанного текста или из Вашего жизненного опыта. (Не учитываются примеры, источниками которых являются комикс, аниме, манга, фанфик, графический роман, компьютерная игра и другие подобные виды представления информации.) Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой пересказанный или полностью переписанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком.",
          "correctAnswer": "",
          "answerType": "long"
        }
      ]
    },
    {
      "id": 10,
      "name": "Вариант 10",
      "questions": [
        {
          "id": 1,
          "text": "Укажите варианты ответов, в которых верно определена грамматическая основа в одном из предложений или в одной из частей сложного предложения текста. Запишите номера ответов.",
          "body": "(1) В саду зацвели яблони и наполнили воздух сладким запахом.\n(2) Под деревьями были расставлены деревянные скамейки.\n(3) Пчёлы, неутомимые труженицы весны, кружили над цветами.\n(4) Гости, которые приехали к полудню, уже сидели в беседке.\n(5) День обещал быть солнечным.\n\n1) яблони зацвели (предложение 1)\n2) были расставлены скамейки (предложение 2)\n3) труженицы кружили (предложение 3)\n4) которые приехали (предложение 4)\n5) день обещал (предложение 5)",
          "correctAnswer": "145",
          "answerType": "short"
        },
        {
          "id": 2,
          "text": "Укажите варианты ответов, в которых даны верные характеристики предложений текста. Запишите номера ответов.",
          "body": "(1) В саду зацвели яблони и наполнили воздух сладким запахом.\n(2) Под деревьями были расставлены деревянные скамейки.\n(3) Пчёлы, неутомимые труженицы весны, кружили над цветами.\n(4) Гости, которые приехали к полудню, уже сидели в беседке.\n(5) День обещал быть солнечным.\n\n1) В предложении 1 есть однородные сказуемые.\n2) Предложение 2 является безличным.\n3) Предложение 3 осложнено приложением.\n4) В предложении 4 есть придаточное определительное.\n5) Предложение 5 сложное.",
          "correctAnswer": "134",
          "answerType": "short"
        },
        {
          "id": 3,
          "text": "Установите соответствие между пунктуационными правилами и предложениями, которые могут служить примерами для приведённых правил. Запишите цифры в порядке АБВ.",
          "body": "ПУНКТУАЦИОННЫЕ ПРАВИЛА\n\nА) Между подлежащим и сказуемым ставится тире.\nБ) Между частями сложного бессоюзного предложения ставится двоеточие, если вторая часть поясняет первую.\nВ) В сложноподчинённом предложении между главным и придаточным предложением ставится запятая.\n\nПРЕДЛОЖЕНИЯ\n\n1) Весна — время надежд.\n2) Я остановился: впереди открывался сад.\n3) Когда выглянуло солнце, птицы запели громче.\n4) Ветер стих, и стало особенно тихо.\n5) На дорожке лежали лепестки.",
          "correctAnswer": "123",
          "answerType": "short"
        },
        {
          "id": 4,
          "text": "Расставьте знаки препинания. Укажите цифры, на месте которых должно стоять тире.",
          "body": "Весенний сад (1) настоящее чудо. Главное украшение участка (2) старые яблони. Их цветение (3) короткий, но яркий праздник. У калитки стояли гости (4) и хозяева дома. Тёплый майский день (5) лучший повод собраться вместе.",
          "correctAnswer": "1235",
          "answerType": "short"
        },
        {
          "id": 5,
          "text": "Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера ответов.",
          "body": "1) ПРИУСАДЕБНЫЙ — приставка ПРИ- обозначает близость.\n2) БЕСШУМНЫЙ — на конце приставки перед глухим согласным пишется С.\n3) ЦЫПЛЁНОК — написание Ы после Ц является исключением.\n4) НЕ УБРАННАЯ ВОВРЕМЯ комната — причастие с зависимым словом пишется раздельно.\n5) КАСАТЬСЯ — в корне всегда пишется О.",
          "correctAnswer": "1234",
          "answerType": "short"
        },
        {
          "id": 6,
          "text": "Прочитайте текст. Вставьте пропущенные буквы. Укажите все цифры, на месте которых пишется буква О.",
          "body": "Мы прик(1)..снулись к прохладной коре яблони, потом прошли по тр(2)..пинке к беседке и увидели, как над сад(3)..м заг(4)..релось солнце. Вск(5)..ре в листве зазвенели птицы.",
          "correctAnswer": "12345",
          "answerType": "short"
        },
        {
          "id": 7,
          "text": "Раскройте скобки и запишите слово в соответствующей форме, соблюдая нормы современного русского литературного языка.",
          "body": "До станции оставалось около (пятьсот) шагов.",
          "correctAnswer": "пятисот",
          "answerType": "short"
        },
        {
          "id": 8,
          "text": "Синтаксический анализ. Замените словосочетание, построенное на основе управления, синонимичным словосочетанием со связью примыкание. Напишите получившееся словосочетание, соблюдая нормы современного русского литературного языка.",
          "body": "Замените словосочетание «улыбнулся с теплотой» синонимичным словосочетанием со связью примыкание.",
          "correctAnswer": "улыбнулся тепло",
          "answerType": "short"
        },
        {
          "id": 9,
          "text": "Анализ содержания текста. Какие из высказываний соответствуют содержанию текста? Укажите номера ответов.",
          "body": "(1) На даче у тёти всегда было много работы, и в детстве я этого терпеть не мог. (2) Мне хотелось гулять, кататься на велосипеде и ничего не делать, а вместо этого приходилось полоть грядки, собирать яблоки или носить воду. (3) Особенно я не любил ухаживать за маленькими саженцами у забора: казалось, что от них слишком мало пользы. (4) Тётя только смеялась и говорила, что дерево сначала растёт медленно, зато потом щедро благодарит за терпение. (5) Тогда её слова казались мне обычным взрослым нравоучением. (6) Прошло несколько лет, и однажды я приехал на дачу уже весной, когда вдоль забора впервые зацвели те самые яблони. (7) Бело-розовые ветви гудели от пчёл, а весь участок пах так, будто кто-то разлил в воздухе сладкий мёд. (8) Я стоял и вдруг вспоминал, как ленился таскать воду к этим тонким прутикам. (9) Наверное, именно в тот момент я впервые понял цену терпения и тихого ежедневного труда.\n\n1) В детстве герой любил работать на даче.\n2) Больше всего он не любил ухаживать за саженцами.\n3) Тётя считала, что дерево не требует терпения.\n4) Через несколько лет герой увидел цветение тех самых яблонь.\n5) После этого он так и не понял, зачем нужен труд.",
          "correctAnswer": "24",
          "answerType": "short"
        },
        {
          "id": 10,
          "text": "Анализ средств выразительности. Укажите варианты ответов, в которых средством выразительности речи является фразеологизм.",
          "body": "(1) На даче у тёти всегда было много работы, и в детстве я этого терпеть не мог. (2) Мне хотелось гулять, кататься на велосипеде и ничего не делать, а вместо этого приходилось полоть грядки, собирать яблоки или носить воду. (3) Особенно я не любил ухаживать за маленькими саженцами у забора: казалось, что от них слишком мало пользы. (4) Тётя только смеялась и говорила, что дерево сначала растёт медленно, зато потом щедро благодарит за терпение. (5) Тогда её слова казались мне обычным взрослым нравоучением. (6) Прошло несколько лет, и однажды я приехал на дачу уже весной, когда вдоль забора впервые зацвели те самые яблони. (7) Бело-розовые ветви гудели от пчёл, а весь участок пах так, будто кто-то разлил в воздухе сладкий мёд. (8) Я стоял и вдруг вспоминал, как ленился таскать воду к этим тонким прутикам. (9) Наверное, именно в тот момент я впервые понял цену терпения и тихого ежедневного труда.\n\n1) В детстве я этого терпеть не мог.\n2) Мне хотелось гулять, кататься на велосипеде и ничего не делать.\n3) Тётя только смеялась и говорила.\n4) Бело-розовые ветви гудели от пчёл.\n5) Я впервые понял цену терпения.",
          "correctAnswer": "1",
          "answerType": "short"
        },
        {
          "id": 11,
          "text": "Лексический анализ. Выпишите синоним из указанного диапазона предложений.",
          "body": "(1) На даче у тёти всегда было много работы, и в детстве я этого терпеть не мог. (2) Мне хотелось гулять, кататься на велосипеде и ничего не делать, а вместо этого приходилось полоть грядки, собирать яблоки или носить воду. (3) Особенно я не любил ухаживать за маленькими саженцами у забора: казалось, что от них слишком мало пользы. (4) Тётя только смеялась и говорила, что дерево сначала растёт медленно, зато потом щедро благодарит за терпение. (5) Тогда её слова казались мне обычным взрослым нравоучением. (6) Прошло несколько лет, и однажды я приехал на дачу уже весной, когда вдоль забора впервые зацвели те самые яблони. (7) Бело-розовые ветви гудели от пчёл, а весь участок пах так, будто кто-то разлил в воздухе сладкий мёд. (8) Я стоял и вдруг вспоминал, как ленился таскать воду к этим тонким прутикам. (9) Наверное, именно в тот момент я впервые понял цену терпения и тихого ежедневного труда.\n\nСреди предложений 1–9 найдите синоним к слову РАБОТА из предложения 1. Выпишите этот синоним.",
          "correctAnswer": "труда",
          "answerType": "short"
        },
        {
          "id": 12,
          "text": "Используя прочитанный текст, выполните на отдельном листе ТОЛЬКО ОДНО из заданий (1, 2 или 3). Перед написанием сочинения запишите номер выбранного задания (1, 2 или 3).",
          "body": "1. Напишите сочинение-рассуждение на тему: «Какие средства языка использовал автор, чтобы создать образы мальчишек?».\n\nПриведите в сочинении два примера из прочитанного текста, подтверждающих Ваши рассуждения. Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой полностью переписанный или пересказанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком.\n\n2. Напишите сочинение-рассуждение. Объясните, как Вы понимаете смысл смысл финала текста: «Но он рад был происшествию, потому что Витёк его зауважал и Сивка оказался Сивкой, а не чем-то вроде...».\n\nПриведите в сочинении два примера из прочитанного текста, подтверждающих Ваши рассуждения. Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой полностью переписанный или пересказанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком.\n\n3. Напишите сочинение-рассуждение на тему «Как можно завоевать уважение?». Дайте обоснованный ответ на вопрос, сформулированный в теме сочинения.\n\nПриведите в сочинении два примера, подтверждающих Ваши рассуждения: один пример — из прочитанного текста, а другой — из прочитанного текста или из Вашего жизненного опыта. (Не учитываются примеры, источниками которых являются комикс, аниме, манга, фанфик, графический роман, компьютерная игра и другие подобные виды представления информации.) Приводя примеры, Вы можете использовать различные способы обращения к прочитанному тексту.\n\nОбъём сочинения должен составлять не менее 70 слов.\n\nЕсли сочинение представляет собой пересказанный или полностью переписанный исходный текст без каких бы то ни было комментариев, то такая работа оценивается нулём баллов.\n\nСочинение пишите аккуратно, разборчивым почерком.",
          "correctAnswer": "",
          "answerType": "long"
        }
      ]
    }
  ],
  "topics": [],
  "questions": []
};

const topicBlueprint = [
  { id: 1, name: "Грамматическая основа", questionsType: "short" },
  { id: 2, name: "Анализ предложений текста", questionsType: "short" },
  { id: 3, name: "Пунктуационный анализ", questionsType: "short" },
  { id: 4, name: "Знаки препинания", questionsType: "short" },
  { id: 5, name: "Орфографический анализ", questionsType: "short" },
  { id: 6, name: "Вставка букв", questionsType: "short" },
  { id: 7, name: "Грамматические нормы", questionsType: "short" },
  { id: 8, name: "Синтаксический анализ", questionsType: "short" },
  { id: 9, name: "Анализ содержания текста", questionsType: "short" },
  { id: 10, name: "Анализ средств выразительности", questionsType: "short" },
  { id: 11, name: "Лексический анализ", questionsType: "short" },
  { id: 12, name: "Сочинение", questionsType: "long" },
];

const topics = topicBlueprint.map((topic) => ({ ...topic }));

const questions = data.variants.flatMap((variant) =>
  variant.questions.map((question, index) => {
    const fallbackTopic = {
      id: index + 1,
      name: `Задание ${index + 1}`,
      questionsType: question.answerType === "long" ? "long" : "short",
    };
    const topic = topics[index] ?? fallbackTopic;

    return {
      ...question,
      id: variant.id * 100 + index + 1,
      topic: {
        id: topic.id,
        name: topic.name,
      },
      variantId: variant.id,
      variantName: variant.name,
    };
  })
);

data.topics = topics;
data.questions = questions;

export default data;




